Repository: blackav/ejudge
Catalog: ejudge.*.UTF-8.po
Languages: ru

source: access denied
ru: в доступе отказано

source: action is temporarily unavailable
ru: запрос временно не может быть выполнен

source: all
ru: все

source: allowed only in virtual contest
ru: разрешено только в виртуальных турнирах

source: bad XML
ru: недопустимый XML

source: bad contest identifier
ru: неверный идентификатор турнира

source: bad user identifier
ru: неверный идентификатор пользователя

source: cannot connect to the server
ru: нет связи с сервером

source: clarification requests are disabled
ru: сообщения отключены

source: clients suspended
ru: клиенты приостановлены

source: contains invalid characters
ru: содержит недопустимые символы

source: contest deadline exceeded
ru: регистрация на турнир завершена

source: conversion from string to bool failed
ru: преобразование из типа string в тип bool завершилось с ошибкой

source: conversion from string to dur_t failed
ru: преобразование из типа string в тип dur_t завершилось с ошибкой

source: conversion from string to hash_t failed
ru: преобразование из типа string в тип hash_t завершилось с ошибкой

source: conversion from string to int failed
ru: преобразование из типа string в тип int завершилось с ошибкой

source: conversion from string to ip_t failed
ru: преобразование из типа string в тип ip_t завершилось с ошибкой

source: conversion from string to result_t failed
ru: преобразование из типа string в тип result_t завершилось с ошибкой

source: conversion from string to time_t failed
ru: преобразование из типа string в тип time_t завершилось с ошибкой

source: data format error
ru: Ошибка формата данных

source: database error
ru: ошибка базы данных

source: division by zero
ru: деление на ноль

source: duplicated submission
ru: Повторная посылка

source: e-mail sending failed
ru: отсылка электронной почты завершилась неудачно

source: error code 1
ru: ошибка с кодом 1

source: generic server error
ru: неопределённая ошибка сервера

source: group with this name already exists
ru: группа с таким временем уже существует

source: incomplete registration
ru: неполная регистрация

source: integer overflow
ru: целочисленное переполнение

source: invalid argument
ru: неверный аргумент

source: invalid argument type
ru: неверный тип аргумента

source: invalid clar_id
ru: неверный идентификатор сообщения

source: invalid contest duration
ru: неверная продолжительность турнира

source: invalid contest_id
ru: неверный идентификатор турнира

source: invalid field
ru: неверный идентификатор поля

source: invalid filter expression
ru: Неверное условие отбора

source: invalid group id
ru: неверный идентификатор группы

source: invalid language
ru: неверный идентификатор языка программирования

source: invalid login
ru: неверное регистрационное имя

source: invalid member
ru: неверный участник

source: invalid password
ru: неверный пароль

source: invalid prob_id
ru: неверный идентификатор задачи

source: invalid run status
ru: неверный статус попытки

source: invalid run_id
ru: неверный номер посылки

source: invalid socket path
ru: неверный путь к сокету

source: invalid test number
ru: неверный номер теста

source: invalid user group
ru: неверная группа пользователей

source: invalid user_id
ru: неверный идентификатор пользователя

source: is available for this contest. Note, however, that simplified registration imposes certain restrictions on further use of the account!
ru: доступна для данного турнира. Учтите, однако, что на использование учётных записей, созданных по упрощённой процедуре, наложены некоторые ограничения.

source: is commented
ru: прокомментирован

source: judged
ru: решения проверены

source: judges
ru: судьи

source: judging
ru: проверка решений

source: language
ru: язык

source: last 15
ru: последние 15

source: login already used
ru: регистрационное имя занято

source: message subject is too long
ru: слишком длинная тема сообщения

source: moderated
ru: модерируемая

source: ms
ru: мс

source: msec
ru: мс

source: must be specified
ru: должно быть заполнено

source: no connection to server
ru: нет связи с сервером

source: no error
ru: нет ошибки

source: nonexistent cookie
ru: несуществующее cookie

source: not connected to server
ru: нет связи с сервером

source: not implemented
ru: не реализовано

source: open
ru: открытая

source: operation is not supported
ru: операция не поддерживается

source: out of memory
ru: недостаточно памяти

source: packet receive failed
ru: получение пакета завершилось неудачно

source: packet sending failed
ru: посылка пакета завершилась неудачно

source: password
ru: пароль

source: peer closed connection
ru: сервер оборвал соединение

source: permission denied
ru: в доступе отказано

source: printing suspended
ru: печать приостановлена

source: protocol error
ru: ошибка протокола

source: range error
ru: ошибка диапазона

source: read error
ru: ошибка чтения

source: read error from server
ru: ошибка чтения данных от сервера

source: regular registration
ru: Стандартная регистрация

source: report is not available
ru: протокол недоступен

source: s
ru: с

source: some component of request is too large
ru: некоторые компоненты запроса имеют слишком большой размер

source: standings
ru: положение участников

source: submission log
ru: журнал посылок

source: system call failed
ru: системный вызов завершился неудачно

source: team pages quota is exceeded
ru: превышена квота страниц пользователя

source: testing suspended
ru: тестирование приостановлено

source: the contest is already finished
ru: турнир уже завершён

source: the contest is already started
ru: турнир уже запущен

source: the contest is not finished
ru: турнир ещё не закончился

source: the contest is not started
ru: турнир ещё не начался

source: the program is already printed
ru: эта программа уже напечатана

source: the requested file does not exist
ru: запрошенный файл не существует

source: the run is read-only
ru: Эта посылка не может быть изменена

source: the session identifier is invalid
ru: недопустимый идентификатор сессии

source: the user quota is exceeded
ru: превышена квота пользователя

source: there are transient runs
ru: существуют временные посылки

source: this IP address is not allowed to use this service
ru: данный сервис недоступен с этого IP-адреса

source: this field cannot be changed
ru: это поле не может быть изменено

source: this field cannot be deleted
ru: это поле не может быть очищено

source: this language is disabled for this problem
ru: этот язык не может быть использован для этой задачи

source: this user cannot participate in this contest
ru: этот пользователь не может участвовать в этом турнире

source: this user is not registered for this contest
ru: этот пользователь не зарегистрирован на данный турнир

source: transitive user contest sharing
ru: транзитивное разделение пользователей турнира

source: unexpected EOF
ru: неожиданный конец файла

source: unexpected EOF from server
ru: неожиданный конец файла от сервера

source: unknown error
ru: неизвестная ошибка

source: unspecified error
ru: неспецифицированная ошибка

source: user
ru: участник

source: user is simple_registered
ru: пользователь создан по упрощенной процедуре регистрации

source: user tries to download runs too often
ru: пользователь слишком часто пытается загрузить свои посылки

source: user's runs downloading disabled
ru: загрузка пользовательских посылок запрещена

source: variant
ru: вариант

source: viewing report is disabled
ru: просмотр отчётов отключён

source: viewing run source is disabled
ru: просмотр текстов программ отключён

source: write error
ru: ошибка записи

source: write error to server
ru: ошибка записи данных на сервер
