Repository: blackav/ejudge
Catalog: ejudge.*.UTF-8.po
Languages: ru

source: Login is empty in row %d
ru: В строке %d не определено регистрационное имя

source: Login is not specified
ru: Поле "Регистрационное имя" не заполнено

source: Login may contain only latin letters, digits, <tt>.</tt> (dot), <tt>-</tt> (minus sign), <tt>_</tt> (undescore).
ru: Имя учётной записи (login) может содержать только латинские буквы, цифры, знаки <tt>.</tt> (точка), <tt>-</tt> (минус), <tt>_</tt> (подчёркивание).

source: Login page
ru: Вход в систему

source: Login successfull. Now entering the main page.
ru: Вход успешный. Теперь переходим к главной странице.

source: Logout
ru: Выйти из системы

source: Long name
ru: Название задачи

source: Lost password recovery [%s]
ru: Восстановление пароля [%s]

source: Magistrant
ru: Студент магистратуры

source: Main URL
ru: Главный URL

source: Main page
ru: Главная

source: Make invisible
ru: Сделать невидимой

source: Make visible
ru: Сделать видимой

source: Male
ru: Мужской

source: Mandatory
ru: Обязательный

source: Mar
ru: Мар

source: Mark BANNED
ru: Установить флаг ЗАБЛОКИРОВАННОСТИ

source: Mark INCOMPLETE
ru: Установить флаг НЕПОЛНОТЫ

source: Mark INVISIBLE
ru: Установить флаг НЕВИДИМОСТИ

source: Mark LOCKED
ru: Установить еще один флаг

source: Mark OK
ru: Разрешить участие

source: Mark PENDING
ru: Поставить на ожидание

source: Mark REJECTED
ru: Отказать в участии

source: Mark displayed runs
ru: Пометить отображённые посылки

source: Marked?
ru: Отмечена?

source: Max memory used
ru: Макс. использованная память

source: Max number of users was
ru: Максимальное число пользователей было

source: Max problem submit count is exceeded
ru: Превышено максимальное число посылок по задаче

source: Max. CPU time: %d.%03d
ru: Макс. время ЦП: %d.%03d

source: Max. CPU time: %d.%03d (time-limit exceeded)
ru: Макс. время ЦП: %d.%03d (превышено)

source: Maximal random number
ru: Максимальное случайное число

source: May
ru: Май

source: May change!
ru: Может измениться!

source: Memory limit
ru: Ограничение памяти

source: Memory limit exceeded
ru: Превышен лимит по памяти

source: Merge runs in XML format
ru: Слить журнал посылок в XML-формате

source: Merging runs
ru: Слияние записей о посылках

source: Message
ru: Сообщение

source: Message is empty
ru: Сообщение пусто

source: Message length is too big
ru: Текст сообщения имеет слишком большую длину

source: Message length is too big (%zu)
ru: Текст сообщения имеет слишком большую длину (%zu)

source: Messages
ru: Сообщения

source: Middle name
ru: Отчество

source: Middle name (En)
ru: Отчество (Англ.)

source: Minimal random number
ru: Максимальное случайное число

source: Mkdir failed
ru: Mkdir не сработал

source: Mkdir(%s) failed: %s
ru: Mkdir(%s) не сработал: %s

source: Moderated registration
ru: Модерируемая регистрация

source: More info
ru: Дополнительная информация

source: Move down
ru: Вниз

source: Move to advisors
ru: Перевести в руководители

source: Move to coaches
ru: Перевести в тренеры

source: Move to contestants
ru: Перевести в участников

source: Move to reserves
ru: Перевести в запасные

source: Move up
ru: Вверх

source: Mult parameter
ru: Параметр mult

source: N/A
ru: Неизв.

source: NO
ru: НЕТ

source: NOT REGISTERED
ru: НЕ ЗАРЕГИСТРИРОВАН

source: Name
ru: Имя

source: Name is empty in row %d
ru: Имя пусто в строке %d

source: Neither user_id, login, name, nor cypher are specified
ru: Ни UId, ни Login, ни Name, ни Cypher не заданы

source: Neither user_id, login, nor name are specified
ru: Ни UId, ни Login, ни Name не заданы

source: New account <tt>%s</tt> is successfully created.
ru: Новая учетная запись <tt>%s</tt> успешно создана.

source: New account is successfully created.
ru: Новая учётная запись создана

source: New duration is too small
ru: Новый продолжительность турнира слишком мала

source: New password
ru: Новый пароль

source: New password (1) is invalid
ru: Новый пароль (1) некорректен

source: New password (2) is invalid
ru: Новый пароль (2) некорректен

source: New password is generated.
ru: Новый пароль сгенерирован.

source: New password is too long
ru: Новый пароль имеет слишком большую длину

source: New passwords do not match
ru: Новые пароли не совпадают друг с другом

source: New status: %s
ru: Новый статус: %s

source: New user account is created
ru: Новая учётная запись создана

source: Next problem
ru: Следующая задача

source: No
ru: Нет

source: No advisors are allowed in this contest
ru: Категория "руководители" не поддерживается для этого турнира

source: No answer
ru: Ответ не дан

source: No answer is given
ru: Ответ не дан

source: No assignable runs.
ru: Нет проверяемых посылок.

source: No assigned variant
ru: Нет назначенного варианта

source: No coaches are allowed in this contest
ru: Категория "тренера" не поддерживается для этого турнира

source: No comments
ru: Без комментариев

source: No comments.
ru: Без комментариев.

source: No connection to the server
ru: Нет связи с сервером

source: No contestants are allowed in this contest
ru: Категория "участники" не поддерживается для этого турнира

source: No directory structure
ru: Нет структуры

source: No email message at all will be sent to you.
ru: Вам НЕ будет выслано никаких электронных писем.

source: No entry for %d/%s
ru: Нет записи для %d/%s

source: No entry for %s/%s
ru: Нет записи для %s/%s

source: No guests are allowed in this contest
ru: Категория "гости" не поддерживается для этого турнира

source: No plugin is available for problem
ru: Для задачи нет модуля сдачи решений

source: No reserves are allowed in this contest
ru: Категория "запасные" не поддерживается для этого турнира

source: No runs to rejudge
ru: Нет посылок для перепроверки

source: No users registered for this contest
ru: На этот турнир никто не зарегистрировался

source: No warnings
ru: Предупреждений нет

source: No.
ru: Нет.

source: Not a virtual contest
ru: Не виртуальный турнир

source: Not all pre-required problems are solved
ru: Решены не все требуемые задачи

source: Not connected
ru: Нет связи с сервером

source: Not set
ru: Не установлено

source: Note, lines are numbered just for your convinience.
ru: Обратите внимание, что строки пронумерованы для удобства проверки.

source: Note, that if you do not do this in 24 hours from the moment of sending this letter, operation will be cancelled. If you don't want to regenerate the password, just ignore this message
ru: Если Вы не выполните эту операцию в течение 24 часов от момента отсылки данного письма, перегенерация пароля будет отменена. Если же Вы не хотите перегенерировать свой пароль, просто проигнорируйте это письмо.

source: Notes
ru: Примечания

source: Nov
ru: Ноя

source: Number
ru: Номер

source: Number of Clars
ru: Число вопросов

source: Number of Runs
ru: Число попыток

source: Number of printed pages
ru: Количество напечатанных страниц

source: Number of warnings
ru: Число предупреждений

source: OVER
ru: ЗАКОНЧЕН

source: OVER (frozen)
ru: ЗАКОНЧЕН (заморозка)

source: Observer
ru: Наблюдатель

source: Occupation
ru: Должность

source: Occupation (En)
ru: Должность (Англ.)

source: Oct
ru: Окт

source: Old password
ru: Старый пароль

source: Old password is invalid
ru: Старый пароль некорректен

source: Old password is too long
ru: Старый пароль имеет слишком большую длину

source: On-line users in this contest
ru: Пользователей в турнире в этот момент

source: Online users
ru: Подключившиеся пользователи

source: Open
ru: Открыть

source: Open date
ru: Дата открытия

source: Open for participation
ru: Открыт для участия

source: Operation completed
ru: Операция завершена

source: Operation completed with errors
ru: Операция завершилась с ошибками

source: Operation errors
ru: Ошибки при выполнении операции

source: Operation failed
ru: Операция не выполнена

source: Operation is not supported
ru: Операция не поддерживается

source: Operation succeeded
ru: Операция успешно выполнена

source: Optional
ru: Необязательный

source: Originator IP
ru: IP-адрес отправителя

source: Other
ru: Прочее

source: Output
ru: Результат работы

source: Output error
ru: Ошибка вывода

source: Output file name
ru: Имя выходного файла

source: Output format
ru: Формат результата

source: Output in
ru: Результат работы в файле

source: Packet is too big
ru: Пакет имеет слишком большой размер

source: Packet is too small
ru: Пакет имеет слишком маленький размер

source: Packet name
ru: Имя пакета

source: Page
ru: Страница

source: Page generation time
ru: Время генерации страницы

source: Pages printed
ru: Напечатано страниц

source: Parameter is out of range
ru: Значение параметра не удовлетворяет диапазону допустимых значений

source: Parameter value
ru: Значение параметра

source: Partial solution
ru: Неполное решение

source: Participant
ru: Участник

source: Participants can view testing reports
ru: Участники могут видеть протоколы тестирования

source: Participants can view their source code
ru: Участники могут просматривать исходный код

source: Participants view judge score
ru: Участники могут видеть финальные баллы

source: Participants' requests are suspended
ru: Обработка запросов участников приостановлена

source: Participants' solutions are being accepted
ru: Решения участников принимаются на проверку

source: Participants' solutions are being judged
ru: Решения участников проверяются

source: Participants' solutions are judged
ru: Решения участников проверены

source: Participate
ru: Участвовать

source: Passed tests
ru: Пройдено тестов

source: Password
ru: Пароль

source: Password generation failed
ru: Генерация паролей не удалась

source: Password generation failed: %s
ru: Генерация паролей не удалась: %s

source: Password recovery completed [%s, %s]
ru: Восстановление пароля завершено [%s, %s]

source: Password recovery error
ru: Ошибка восстановления пароля

source: Password recovery is not possible because of the following error.
ru: Восставновление пароля невозможно из-за следующей ошибки.

source: Password recovery, stage 1 [%s, %s]
ru: Восстановление пароля, этап 1 [%s, %s]

source: Password regeneration requested
ru: Запрошена перегенерация пароля

source: Password regeneration successful
ru: Перегенерация пароля завершена

source: Password update failed
ru: Изменение пароля не удалось

source: Password update failed: %s
ru: Изменение пароля не удалось: %s

source: Penalty
ru: Штраф

source: Pending XML import already exists
ru: Уже есть ждущий импорт XML

source: Pending check
ru: Ожидает проверки

source: Pending review
ru: Ожидает подтверждения

source: Permission denied
ru: В доступе отказано

source: Permission denied. The possible reasons are as follows.
ru: В доступе отказано. Возможные причины этой ошибки перечислены ниже.

source: PhD student
ru: Аспирант

source: Phone
ru: Телефон

source: Place
ru: Место

source: Planned start time
ru: Планируемое время начала турнира

source: Please, enter your valid e-mail address and press the "Create account" button.
ru: Пожалуйста, введите Ваш работающий адрес e-mail и нажмите кнопку "Создать учётную запись".

source: Presentation error
ru: Неправильный формат вывода

source: Press "Stop exam" button to finish the exam. Your answers will be checked shortly after that.
ru: Нажмите на кнопку "Завершить экзамен" чтобы завершить экзамен. После этого Ваши ответы будут проверены.

source: Previous problem
ru: Предыдущая задача

source: Previous submissions of this problem
ru: Предыдущие решения этой задачи

source: Print
ru: Распечатать

source: Print problem protocol
ru: Напечатать протокол по задаче

source: Print requests are suspended
ru: Обработка запросов на печать приостановлена

source: Print sources
ru: Распечатать исходный текст

source: Print the exam full cyphered protocols
ru: Напечатать полные зашифрованные экзаменационные протоколы

source: Print the exam full protocols
ru: Напечатать полные экзаменационные протоколы

source: Print the exam protocols
ru: Напечатать экзаменационные протоколы

source: Print the user examination protocols for the selected users
ru: Напечатать экзаменационные протоколы для отмеченных участников

source: Print the user full cyphered examination protocols for the selected users
ru: Напечатать полные зашифрованные экзаменационные протоколы для отмеченных участников

source: Print the user full examination protocols for the selected users
ru: Напечатать полные экзаменационные протоколы для отмеченных участников

source: Print user examination protocol
ru: Напечатать экзаменационный протокол участника

source: Print user full cyphered examination protocol
ru: Напечатать полный зашифрованный экзаменационный протокол участника

source: Print user full examination protocol
ru: Напечатать полный экзаменационный протокол участника

source: Printing error
ru: Ошибка печати

source: Printing is disabled
ru: Печать отключена

source: Printing problem protocol
ru: Печать протокола по задаче

source: Printing quota (%d pages) is exceeded
ru: Превышена квота печати (%d страниц)

source: Printing quota is exceeded
ru: Превышена квота печати

source: Printing user protocol
ru: Печать экзаменационного протокола участника

source: Priority
ru: Приоритет

source: Priority adjustment
ru: Поправка приоритета

source: Priority value must be in range [-16, 15]. The less the priority value, the more the judging priority.
ru: Значение приоритета должно находиться в интервале [-16, 15]. Чем меньше значение приоритета, тем выше приоритет.

source: Privileged users
ru: Привилегированные пользователи

source: Privileged users page
ru: Список привилегированных пользователей

source: Privileged?
ru: Привилегированный?

source: Problem
ru: Задача

source: Problem column is undefined
ru: Столбец Problem не определен

source: Problem configuration error
ru: Ошибка конфигурации задачи

source: Problem filter expression
ru: Условие отбора задач

source: Problem is empty in row %d
ru: В строке %d не определено имя задачи

source: Problem priority
ru: Приоритет задачи

source: Problem statements
ru: Условия задач

source: Problem status summary
ru: Итог по задачам

source: Problem summary
ru: Итог по задачам

source: Problems
ru: Задачи

source: Problems (serve.cfg)
ru: Задачи (serve.cfg)

source: Professor
ru: Преподаватель вуза

source: Prog. languages
ru: Языки программирования

source: Program output
ru: Вывод программы

source: Program output to stderr
ru: Вывод программы на stderr

source: Program stderr output
ru: Вывод программы на поток ошибок

source: Programming language
ru: Язык программирования

source: Programming languages
ru: Языки программирования

source: Protocol error
ru: Ошибка протокола

source: READ-ONLY
ru: ТОЛЬКО ПРОСМОТР

source: REFRESH
ru: ОБНОВИТЬ

source: REFRESH PAGE MANUALLY!
ru: ОБНОВЛЯЙТЕ СТРАНИЦУ ВРУЧНУЮ!

source: REGISTERED
ru: ЗАРЕГИСТРИРОВАН

source: REGISTERED (INVISIBLE)
ru: ЗАРЕГИСТРИРОВАН (НЕВИДИМЫЙ)

source: REGISTERED, BANNED
ru: ЗАРЕГИСТИРОВАН, ДИСКВАЛИФИЦИРОВАН

source: REGISTERED, LOCKED
ru: ЗАРЕГИСТРИРОВАН, ЗАБЛОКИРОВАН

source: REGISTERED, PENDING APPROVAL
ru: ЗАРЕГИСТРИРОВАН, ОЖИДАЕТ ПОДТВЕРЖДЕНИЯ

source: REGISTRATION REJECTED
ru: РЕГИСТРАЦИЯ ОТКЛОНЕНА

source: RUNNING (frozen)
ru: ТУРНИР ИДЕТ (заморозка)

source: Random seed
ru: Затравка ГПСЧ

source: Random variants
ru: Случайные варианты

source: Re: Your question
ru: Re: Ваш вопрос

source: Read error
ru: Ошибка чтения

source: Read the problem
ru: Читайте условие задачи

source: Read the problem.
ru: Читайте условие задачи.

source: Read-only?
ru: Только чтение?

source: Real time (sec)
ru: Астр. время (с)

source: Real time limit
ru: Ограничение реального времени

source: Recover forgot password
ru: Восстановить забытый пароль

source: Refresh
ru: Обновить

source: Regards, The ejudge contest administration system (www.ejudge.ru)
ru: С уважением, Система ejudge (www.ejudge.ru)

source: Regenerate contest passwords!
ru: Перегенерировать турнирные пароли!

source: Regenerate registration passwords!
ru: Перегенерировать регистрационные пароли!

source: Region
ru: Регион

source: Register for another contest
ru: Зарегистрировать на другой турнир

source: Register for another contest and copy data
ru: Зарегистрировать на другой турнир и скопировать данные

source: Registration
ru: Регистрация

source: Registration deadline
ru: Срок регистрации

source: Registration errors
ru: Ошибки при регистрации

source: Registration failed
ru: Регистрация не удалась

source: Registration failed: %s
ru: Регистрация не удалась: %s

source: Registration for contest failed
ru: Регистрация на турнир завершилась с ошибкой

source: Registration incomplete
ru: Регистрационные данные неполны

source: Registration is incomplete
ru: Регистрационные данные неполны

source: Registration mode
ru: Режим регистрации

source: Registration password
ru: Регистрационный пароль

source: Registration passwords
ru: Регистрационные пароли

source: Registration rules
ru: Правила регистрации

source: Registration time
ru: Время регистрации на турнир

source: Regular users
ru: Обычные пользователи

source: Rejected
ru: Отклонено

source: Rejudge all
ru: Пересудить всё

source: Rejudge all runs
ru: Пересудить все

source: Rejudge all!!!
ru: Пересудить всё!!!

source: Rejudge displayed runs
ru: Перепроверить отображённые посылки

source: Rejudge displayed runs!
ru: Перепроверить отображённые посылки!

source: Rejudge problem
ru: Пересудить задачу

source: Rejudge problem!
ru: Пересудить задачу!

source: Rejudge runs
ru: Пересудить

source: Reload
ru: Перезагрузить

source: Reload config files
ru: Перезагрузить конфигурационные файлы

source: Remaining
ru: Остаётся

source: Remaining attempts
ru: Оставшиеся посылки

source: Remaining time
ru: Оставшееся время

source: Remember or write down the password!
ru: Запомните или запишите пароль!

source: Removal of privileged user %d from contest %d failed
ru: Удаление привилегированного пользователя %d из турнира %d не удалось

source: Removal of privileged user from contest failed
ru: Удаление привилегированного пользователя из турнира не удалось

source: Removal of user %d from contest %d failed: %s
ru: Удаление пользователя %d из турнира %d не удалось: %s

source: Removal of user from contest failed
ru: Удаление пользователя из турнира не удалось

source: Remove
ru: Удалить

source: Remove ban
ru: Снять блокировку

source: Remove examiner
ru: Удалить экзаменатора

source: Remove from group
ru: Удалить из группы

source: Remove registrations
ru: Удалить регистрации

source: Remove the CHIEF EXAMINER role from the selected users
ru: Запретить работу в роли ГЛАВНОГО ЭКЗАМЕНАТОРА отмеченным пользователям

source: Remove the COORDINATOR role from the selected users
ru: Запретить работу в роли КООРДИНАТОРА отмеченным пользователям

source: Remove the EXAMINER role from the selected users
ru: Запретить работу в роли ЭКЗАМЕНАТОРА отмеченным пользователям

source: Remove the OBSERVER role from the selected users
ru: Запретить работу в роли НАБЛЮДАТЕЛЯ отмеченным пользователям

source: Remove the selected users from the list
ru: Удалить отмеченных пользователей

source: Remove the selected users from the list (ADMINISTRATORs cannot be removed)
ru: Удалить отмеченных пользователей из списка (АДМИНИСТРАТОРЫ не могут быть удалены)

source: Reply to all
ru: Разослать всем

source: Reply to sender
ru: Ответить только отправителю

source: Report
ru: Протокол

source: Report file does not exist
ru: Запрошенный файл не существует

source: Report for run
ru: Отчет по посылке

source: Report is not available
ru: Протокол недоступен

source: Report viewing is disabled
ru: Просмотр протоколов отключён

source: Reschedule
ru: Назначить время

source: Reserve
ru: Запасной участник

source: Reserves
ru: Запасные участники

source: Reset filter
ru: Сбросить фильтр

source: Reset the contest
ru: Сбросить турнир

source: Reset the contest!
ru: Сбросить турнир!

source: Reset the contest!!!
ru: Сбросить турнир!!!

source: Restart virtual contest
ru: Рестартовать виртуальный турнир

source: Result
ru: Результат

source: Resume clients
ru: Разрешить работу клиентов

source: Resume printing
ru: Разрешить печать решений

source: Resume testing
ru: Разрешить проверку решений

source: Return to the main page
ru: Вернуться к главной странице

source: Retype new password
ru: Пароль ещё раз

source: Review notes
ru: Заметки для проверки

source: Role
ru: Роль

source: Run
ru: Посылка

source: Run ID
ru: Номер решения

source: Run comment
ru: Комментарий к программе

source: Run comments
ru: Комментарии к программе

source: Run filter expression
ru: Условие отбора посылок

source: Run is read-only
ru: Эта посылка не может быть изменена

source: Run log update failed
ru: Обновление журнала посылок не удалось

source: Run penalty
ru: Штраф за посылку

source: Run selection
ru: Выбор посылок

source: Run to compare to is not specified
ru: Посылка для сравнения не указана

source: Run-time error
ru: Ошибка выполнения

source: Running...
ru: Выполняется...

source: Runs accepted for testing
ru: Посылок, принятых на проверку

source: Runs being processed
ru: Обрабатываемые посылки

source: Runs pending review
ru: Посылок ожидает подтверждения

source: Runs pending testing
ru: Посылок ожидающих тестирования

source: Runs to change token info:
ru: Посылки для изменения информации о токене:

source: STATUS UPDATE FAILED!
ru: ОШИБКА ОБНОВЛЕНИЯ СТАТУСА!

source: Save
ru: Сохранить

source: Saved?
ru: Сохранена?

source: Scheduled end time
ru: Запланированное время окончания

source: School student
ru: Школьник

source: School teacher
ru: Школьный учитель

source: Scientist
ru: Научный сотрудник

source: Score
ru: Баллы

source: Score adjustment
ru: Поправка баллов

source: Score bonus
ru: Бонусные баллы

source: Score column is undefined
ru: Столбец Score не определен

source: Score gained
ru: Получено баллов

source: Score gained: %d (out of %d).
ru: Получено баллов: %d (из %d).

source: Score gained: %d (out of %d).<br/><br/></big>
ru: Получено баллов: %d (из %d).<br/><br/></big>

source: Score gained: %d (out of %d).<br><br></big>
ru: Получено баллов: %d (из %d).<br><br></big>

source: Score is empty in row %d
ru: Баллы не заданы в строке %d

source: Score value `%s' is invalid in row %d
ru: Значение баллов `%s' недопустимо в строке %d

source: Security violation
ru: Нарушение правил безопасности

source: Select another problem
ru: Выбрать другую задачу

source: Select one of available contests
ru: Выберите один из доступных турниров

source: Select problem
ru: Выбрать задачу

source: Select variant
ru: Выбрать вариант

source: Send a message
ru: Отправить сообщение судьям

source: Send a message to judges
ru: Отправить сообщение судьям

source: Send an appeal
ru: Отправить аппеляцию

source: Send clarification
ru: Отправить сообщение

source: Send e-mail with password anyway
ru: Выслать сообщение с паролем в любом случае

source: Send run comment
ru: Отправить комментарий к программе

source: Send run comment and OK run
ru: Отправить комментарий к программе и принять посылку

source: Send run comment and REJECT run
ru: Отправить комментарий к программе и отклонить посылку

source: Send run comment and ignore run
ru: Отправить комментарий к программе и игнорировать посылку

source: Send!
ru: Отправить!

source: Sender
ru: Отправитель

source: Sent submissions
ru: Отправленные решения

source: Sep
ru: Сен

source: Serial No
ru: NN

source: Server error
ru: Ошибка сервера

source: Server is down
ru: Сервер не работает

source: Server start time
ru: Время запуска сервера

source: Server status
ru: Состояние сервера

source: Server time
ru: Время на сервере

source: Service is not available
ru: Сервис недоступен

source: Service is not available. Please, come later.
ru: Сервис недоступен. Пожалуйста, приходите позже.

source: Service not available
ru: Сервис недоступен

source: Service that you requested is not available.
ru: Запрошенный Вами сервис недоступен.
