Repository: blackav/ejudge
Catalog: ejudge.*.UTF-8.po
Languages: ru

source: Session update failed
ru: Изменение параметров сессии не удалось

source: Session update failed: %s
ru: Изменение параметров сессии не удалось: %s

source: Set REJECTED run status
ru: Установить статус Отклонено (REJECTED)

source: Set accepting mode
ru: Включить режим приёма решений

source: Set filter
ru: Установить фильтр

source: Set finished flag
ru: Установить флаг законченности проверки

source: Set judging mode
ru: Включить режим проверки

source: Set permissions
ru: Установить права

source: Set priorities
ru: Установить приоритеты

source: Set the BANNED flag for the selected users
ru: Установить флаг ЗАБЛОКИРОВАННОСТИ для отмеченных пользователей

source: Set the INCOMPLETE flag for the selected users
ru: Установить флаг НЕПОЛНОТЫ для отмеченных пользователей

source: Set the INVISIBLE flag for the selected users
ru: Установить флаг НЕВИДИМОСТИ для отмеченных пользователей

source: Set the LOCKED flag for the selected users
ru: Установить флаг LOCKED для отмеченных пользователей

source: Set the registration status of the selected users to OK
ru: Установить статус регистрации в OK, то есть разрешить участие

source: Set the registration status of the selected users to PENDING
ru: Установить статус регистрации в PENDING, то есть отложить решение

source: Set the registration status of the selected users to REJECTED
ru: Установить статус регистрации в REJECTED, то есть отказать в участии

source: Settings
ru: Настройки

source: Shift parameter
ru: Параметр shift

source: Short name
ru: ID Задачи

source: Show closed contests
ru: Показать закрытые турниры

source: Show hidden contests
ru: Показать скрытые турниры

source: Show tests
ru: Разрешить просмотр согласно правилам видимости тестов

source: Show unmanageable contests
ru: Показать неуправляемые турниры

source: Shown
ru: Показано

source: Signal
ru: Сигнал

source: Simplified registration
ru: Упрощенная регистрация

source: Size
ru: Размер

source: Skipped
ru: Пропущен

source: Solved
ru: Решено

source: Solved<br/>problems
ru: Решённые<br/>задачи

source: Source
ru: Исходный код

source: Source code
ru: Исходный код

source: Source code is closed
ru: Просмотр исходного кода закрыт

source: Source code is open
ru: Просмотр исходного кода открыт

source: Source file does not exist
ru: Запрошенный файл не существует

source: Source for run
ru: Исходный код

source: Source for this run is not available
ru: Текст для этой посылки недоступен

source: Squeeze runs
ru: Сжать журнал

source: Stack limit
ru: Ограничение размера стека

source: Standings
ru: Положение участников

source: Standings [%s, frozen]
ru: Положение участников [%s, заморожено]

source: Standings [not started]
ru: Положение [не начат]

source: Standings [over, frozen]
ru: Положение участников [окончено, заморожено]

source: Standings [over]
ru: Положение участников [закончено]

source: Standings freeze time
ru: Время заморозки таблицы результатов

source: Standings unfreeze time
ru: Время разморозки таблицы результатов

source: Start
ru: Начать

source: Start at
ru: Начало в

source: Start exam
ru: Начать экзамен

source: Start new
ru: Начать новый

source: Start new editing
ru: Начать новое редактирование

source: Start upsolving
ru: Открыть дорешивание

source: Start virtual contest
ru: Начать виртуальный турнир

source: Statement
ru: Условие

source: Statements
ru: Условия

source: Static priority
ru: Статический приоритет

source: Status
ru: Статус

source: Status is empty in row %d
ru: Статус не задан в строке %d

source: Status of your submit %d is changed in contest %d
ru: Статус Вашей посылки %d был изменен в турнире %d

source: Status of your submit is changed
ru: Статус Вашей посылки был изменен

source: Stop
ru: Остановить

source: Stop exam
ru: Завершить экзамен

source: Stop upsolving
ru: Закрыть дорешивание

source: Stop virtual contest
ru: Закончить виртуальный турнир

source: Street address
ru: Улица, дом, квартира

source: Student
ru: Студент

source: Subject
ru: Тема

source: Subject is empty
ru: Тема сообщения не задана

source: Subject length is too big
ru: Поле "Тема" имеет слишком большую длину

source: Subject length is too big (%zu)
ru: Поле "Тема" имеет слишком большую длину (%zu)

source: Submission log
ru: Журнал посылок

source: Submission time
ru: Время попытки

source: Submissions
ru: Посылки

source: Submit
ru: Отправить

source: Submit a solution
ru: Сдать решение

source: Submit a solution for
ru: Сдать решение задачи

source: Submit appeal
ru: Отправить апелляцию

source: Submit clar
ru: Отправить вопрос

source: Submit image
ru: Отправить изображение

source: Submit solution!
ru: Сдать решение!

source: Submit source viewing is disabled
ru: Просмотр текстов программ отключён

source: Submit testing mode
ru: Включить режим приёма решений

source: Success
ru: Успешных

source: Summary
ru: Итог

source: Suspend clients
ru: Приостановить клиентов

source: Suspend printing
ru: Приостановить печать решений

source: Suspend testing
ru: Приостановить проверку решений

source: Switch language
ru: Переключить язык

source: Synchronization error
ru: Ошибка синхронизации

source: System error
ru: Системная ошибка

source: TESTING COMPLETED
ru: ТЕСТИРОВАНИЕ ЗАВЕРШЕНО

source: TESTING IN PROGRESS...
ru: ИДЕТ ТЕСТИРОВАНИЕ...

source: Team name
ru: Название команды

source: Test file does not exist
ru: Запрошенный файл не существует

source: Test file is not available
ru: Тест недоступен

source: Test information
ru: Информация о тесте

source: Test input
ru: Входные данные

source: Test input data
ru: Входные данные

source: Test number
ru: Номер теста

source: Testing comments
ru: Комментарии по тестированию

source: Testing is in progress...
ru: Идёт проверка ответов...

source: Testing messages
ru: Сообщения при тестировании

source: Testing of participants' submits is suspended
ru: Проверка решений участников приостановлена

source: Testing queue
ru: Очередь тестирования

source: Testing reports are closed
ru: Просмотр отчетов закрыт

source: Testing reports are open
ru: Просмотр отчетов открыт

source: Tests
ru: Тесты

source: Tests is empty in row %d
ru: Тесты не заданы в строке %d

source: Tests passed
ru: Пройдено тестов

source: Tests value `%s' is invalid in row %d
ru: Значение тестов `%s' недопустимо в строке %d

source: The account parameters are as follows:
ru: Ваша регистрационная запись имеет следующие параметры:

source: The contest is in progress
ru: Турнир идёт

source: The contest is in progress (standings are frozen)
ru: Турнир идёт (текущее положение участников не отображается)

source: The contest is not started
ru: Турнир не начался

source: The contest is over
ru: Турнир закончился

source: The contest is over (standings are frozen)
ru: Турнир закончился (текущее положение участников не отображается)

source: The contest is personal
ru: Турнир личный

source: The contest is temporarily not available. Please, retry the request a bit later.
ru: В данный момент турнир временно недоступен. Попробуйте повторить запрос чуть позже.

source: The exam is in progress
ru: Экзамен идёт

source: The exam is in progress (standings are frozen)
ru: Экзамен идёт (текущее положение участников не отображается)

source: The exam is not started
ru: Экзамен не начался

source: The exam is over
ru: Экзамен закончился

source: The exam is over (standings are frozen)
ru: Экзамен закончился (текущее положение участников не отображается)

source: The language %s is disabled for this problem
ru: Язык %s запрещён для этой задачи

source: The language is disabled for this problem
ru: Язык запрещён для этой задачи

source: The problem statement is not available
ru: Условие задачи недоступно

source: The server is down. Try again later.
ru: Сервер не работает. Пожалуйста, повторите операцию позднее.

source: The server was unable to send a registration e-mail to the specified address. This is probably due to heavy server load rather than to an invalid e-mail address. You should try to register later.
ru: Сервер оказался не в состоянии отправить регистрационное письмо по указанному адресу. Это, возможно, произошло из-за слишком высокой загрузки сервера, а не из-за неправильного адреса e-mail. Повторите попытку регистрации позже.

source: The submission is binary and thus is not shown.
ru: Посылка не является текстовым файлом и поэтому не показана.

source: The user database server is currently not available. Please, retry the request later.
ru: Сервер базы данных пользователей в настоящий момент недоступен. Попробуйте повторить запрос позднее.

source: This contest cannot be continued
ru: Этот турнир не может быть продолжен

source: This contest operates in "simplified registration" mode. You will get your login and password immediately after account is created.
ru: В этом турнире включена упрощённая процедура регистрации. Вы получите пароль от своей учётной записи немедленно после её создания (без использования электронной почты).

source: This contest operates in \"simplified registration\" mode. You will get your login and password immediately after account is created.
ru: В этом турнире включена упрощённая процедура регистрации. Вы получите пароль от своей учётной записи немедленно после её создания (без использования электронной почты).

source: This language is disabled for use
ru: Этот язык не может быть использован для этой задачи

source: This language is not available for this problem
ru: Язык не доступен для этой задачи

source: This message contains the login name, assigned to you, as well as your password for initial log in. You will be able to change the password later.
ru: На Ваш электронный адрес будет направлено письмо, которое будет содержать регистрационное имя (login) и пароль для входа в систему. Этот пароль необходимо использовать для первого входа в систему, после чего его можно будет поменять.

source: This message contains the password for the initial log in. You will be able to change the password later.
ru: На Ваш электронный адрес будет направлено письмо, которое будет содержать пароль для входа в систему. Этот пароль необходимо использовать для первого входа в систему, после чего его можно будет поменять.

source: This problem is already solved
ru: Эта задача уже решена

source: This problem is not yet available
ru: Эта задача еще не доступна

source: This program is configured incorrectly and cannot perform normal operation. Please contact the site (or contest) administrator.
ru: Эта программа сконфигурирована неверно и не может работать. Пожалуйста, обратитесь к администратору сайта или турнира.

source: This submit is already printed
ru: Эта программа уже напечатана

source: This submit is duplicate of another run
ru: Эта посылка является копией другой посылки

source: This submit is duplicate of the run %d
ru: Эта посылка является копией посылки %d

source: This test program is correct, but failed on some tests
ru: Эта тестовая программа корректна, но не проходит некоторые тесты

source: This test program is incorrect, but passed all tests
ru: Эта тестовая программа некорректна, но проходит все тесты

source: Time
ru: Время

source: Time (sec)
ru: Время (с)

source: Time limit
ru: Ограничение времени

source: Time-limit exceeded
ru: Превышено максимальное время работы

source: Timestamp
ru: Отметка времени

source: To
ru: Кому

source: To confirm password regeneration, you should visit the following URL: %s?contest_id=%d&locale_id=%d&SID=%016llx&action=%d.
ru: Чтобы сгенерировать новый случайный пароль, вы должны открыть следующий URL: %s?contest_id=%d&locale_id=%d&SID=%016llx&action=%d.

source: To contest details
ru: К деталям турнира

source: To contests list
ru: К списку турниров

source: To create an account, please think out, a login and provide your valid e-mail address in the form above. Then press the \"Create account\" button.
ru: Чтобы создать учётную запись придумайте себе имя учётной записи (login), введите его и Ваш работающий адрес e-mail в форме вверху и нажмите кнопку "Создать учётную запись".

source: To main page
ru: На главную страницу

source: To the top
ru: Наверх

source: To the top (postpone editing)
ru: Наверх (отложить редактирование)

source: To user id
ru: Кому (рег. номер)

source: To user login
ru: Кому (рег. имя)

source: Token counter
ru: Число использованных токенов

source: Tokenize displayed runs
ru: Редактировать токены отображённых посылок

source: Tokenize displayed runs!
ru: Изменить токены отображённых посылок!

source: Too few lines in CSV file
ru: В CSV-файле слишком мало строк

source: Total
ru: Всего

source: Total messages
ru: Всего сообщений

source: Total number of sample programs in the test suite
ru: Общее количество тестовых программ

source: Total number of submitted tests
ru: Общее количество предложенных тестов

source: Total priority
ru: Суммарный приоритет

source: Total score
ru: Суммарный балл

source: Total size of Clars
ru: Суммарный размер вопросов

source: Total size of Runs
ru: Суммарный размер попыток

source: Total submissions
ru: Всего посылок

source: Try again
ru: Попробовать еще раз

source: Try again this operation later
ru: Повторите операцию позже

source: Type the login and the password in to the form above and press the "Log in" button to activate the account.
ru: Введите Ваш логин и пароль в форму сверху и нажмите кнопку "Войти" для активации учетной записи.

source: UId is empty in row %d
ru: Поле UId пусто в строке %d

source: UPSOLVING
ru: ДОРЕШИВАНИЕ

source: Unanswered clars
ru: Неотвеченные сообщения

source: Undefined user_id and login
ru: Неопределен ни user_id, ни login

source: Unexpected EOF
ru: Неожиданный конец файла

source: Unhandled action
ru: Необработанная операция

source: Unhandled action: %d
ru: Необработанная операция: %d

source: Unknown error
ru: Неизвестная ошибка

source: Unknown error %d
ru: Неизвестная ошибка %d

source: Unknown error %d.
ru: Неизвестная ошибка %d.

source: Unlimited
ru: Не ограничена

source: Unlock
ru: Открыть

source: Unmark displayed runs
ru: Разотметить отображённые посылки

source: Up all
ru: Все вверх

source: Update public standings
ru: Обновить публичную таблицу положения участников

source: Update standings!
ru: Обновить таблицу!

source: Update the public standings
ru: Обновить публичную таблицу положения участников

source: Update versions
ru: Обновить версии

source: Upload judging protocol
ru: Установить протокол тестирования

source: Upload!
ru: Установить!

source: Upsolving
ru: Дорешивание

source: Upsolving configuration
ru: Конфигурация дорешивания

source: Upsolving mode
ru: Режим дорешивания

source: Use 'extid' as problem name
ru: Использовать параметр 'extid' задачи вместо имени

source: Use Contest Id
ru: Использовать ID турнира

source: Use an existing account
ru: Использовать существующую учетную запись

source: Use existing contest:
ru: Использовать существующий турнир:

source: Use problem short name
ru: Использовать короткое имя задачи

source: Use programming language short name
ru: Использовать короткое имя языка программирования

source: Use run number
ru: Использовать номер посылки

source: Use source language or content type suffix
ru: Использовать суффикс языка или типа файла

source: Use submit time
ru: Использовать время сдачи

source: Use token
ru: Открыть протокол

source: Use user Id
ru: Использовать идентификатор пользователя

source: Use user Login
ru: Использовать регистрационное имя пользователя

source: Use user Name
ru: Использовать имя участника

source: User
ru: Участник

source: User <tt>%s</tt> does not exist
ru: Пользователь <tt>%s</tt> не существует

source: User ID
ru: Id

source: User Id
ru: Id пользователя

source: User Id %d does not exist
ru: Пользователь с номером %d не существует

source: User Id does not exist
ru: Пользователь не существует

source: User Login
ru: Рег. имя

source: User Name
ru: Имя участника

source: User database server is down
ru: Сервер базы пользователей недоступен

source: User does not exist
ru: Пользователь не существует

source: User filter expression
ru: Условие отбора участников

source: User info
ru: Информация о пользователе

source: User login
ru: Рег. имя команды

source: User login page
ru: Вход в систему

source: User login/ID
ru: Login/ID пользователя

source: User name
ru: Имя участника

source: User name (for standings)
ru: Имя участника (для таблицы результатов)

source: User quota exceeded. This clarification request is too large, you already have too many clarification requests, or the total size of your clarification requests is too big
ru: Превышена квота пользователя на сообщения. Данное сообщение слишком велико, или Вы уже послали слишком много сообщений, или суммарный размер всех Ваших сообщений слишком велик

source: User quota exceeded. This submit is too large, you already have too many submits, or the total size of your submits is too big
ru: Превышена квота пользователя. Данная посылка имеет слишком большой размер, Вами сделано слишком много посылок, или суммарный размер Ваших посылок слишком велик

source: User report
ru: Пользовательский протокол

source: User standings
ru: Положение участников

source: User's report
ru: Пользовательский протокол

source: Userlist server is down
ru: Сервер базы пользователей недоступен

source: Users
ru: Участники

source: Users for IP addresses
ru: Пользователи IP-адресов

source: Users page
ru: Список участников

source: Value of field "%s" is invalid.
ru: Значение поля "%s" некорректно.

source: Valuer comments
ru: Комментарии оценивания

source: Valuer errors
ru: Ошибки при оценивании

source: Valuer information
ru: Информация об оценивании

source: Valuer judge comments
ru: Комментарий об оценивании для судей

source: Variant
ru: Вариант

source: Variants (variant.map)
ru: Варианты (variant.map)

source: View
ru: Просмотр

source: View all
ru: Посмотреть всё

source: View check details
ru: Отчёт о проверке

source: View contest passwords
ru: Просмотреть турнирные пароли

source: View details
ru: Посмотреть детали

source: View last 15
ru: Смотреть последние 15

source: View registration passwords
ru: Просмотреть регистрационные пароли

source: View regular users
ru: Посмотреть список обычных пользователей

source: View report
ru: Просмотреть протокол

source: View serve.cfg
ru: Посмотреть serve.cfg

source: View source
ru: Посмотреть исходный текст

source: View submitted answer
ru: Сданный ответ

source: View the problem statement and send a submission
ru: Посмотреть условие задачи и отправить решение

source: Viewing advisors
ru: Просмотр руководителей

source: Viewing audit log for
ru: Просмотр журнала аудита для

source: Viewing clar
ru: Просмотр посылки

source: Viewing coaches
ru: Просмотр тренеров

source: Viewing contestants
ru: Просмотр участников

source: Viewing general info
ru: Просмотр общей информации

source: Viewing guests
ru: Просмотр гостей

source: Viewing report
ru: Просмотр протокола

source: Viewing reserves
ru: Просмотр запасных

source: Viewing run
ru: Просмотр посылки

source: Viewing settings
ru: Просмотр настроек

source: Viewing user report
ru: Просмотр пользовательского протокола

source: Virtual contest close date
ru: Время закрытия виртуального турнира

source: Virtual contest close time
ru: Время закрытия виртуального турнира

source: Virtual contest is not started
ru: Виртуальный турнир не начат

source: Virtual contest open date
ru: Время открытия виртуального турнира

source: Virtual contest open time
ru: Время открытия виртуального турнира

source: Virtual start
ru: Начало виртуального турнира

source: Virtual start failed
ru: Виртуальный турнир не может быть начат

source: Virtual stop
ru: Окончание виртуального турнира

source: Wall time-limit exceeded
ru: Превышено реальное время работы

source: Warning explanation for the user (mandatory)
ru: Объяснение для участника (обязательно)

source: Warning text for the user
ru: Текст предупреждения для пользователя

source: Warnings
ru: Предупреждения

source: Write error
ru: Ошибка записи

source: Write runs in XML internal format
ru: Сохранить журнал посылок во внутреннем XML-формате

source: Write runs in XML internal format with source
ru: Сохранить журнал посылок во внутреннем XML-формате с исходными кодами

source: Wrong answer
ru: Неправильный ответ

source: Wrong output format
ru: Неправильный формат ответа

source: XML parse error
ru: ошибка разбора XML

source: YES
ru: ДА

source: Yes
ru: Да

source: Yes.
ru: Да.

source: You are disqualified
ru: Вы дисквалифицированы

source: You are disqualified by the contest administration.
ru: Вы дисквалифицированы администрацией турнира.

source: You cannot participate in this contest. Your account was created using the simple registration procedure, i.e. your e-mail address was not verified. This contest requires e-mail verification, so your account cannot be accepted.
ru: Вы не можете принять участие в этом турнире. Ваша регистрационная запись была создана по упрощенной процедуре регистрации, то есть Ваш адрес e-mail не проходил проверки. Этот турнир требует проверенных e-mail адресов, поэтому Ваша регистрационная запись не может быть допущена к участию.

source: You do not have permissions to use this service
ru: У Вас нет прав использовать данный сервис

source: You do not have permissions to use this service.
ru: У Вас нет прав использовать данный сервис.

source: You have been registered
ru: Вы успешно зарегистрированы

source: You have no permissions to view this contest.
ru: У Вас нет прав просматривать данный турнир.

source: You have received a message from judges
ru: Вы получили сообщение от судей

source: You have received a message from judges in contest %d
ru: Вы получили сообщение от судей в турнире %d

source: You have received a reply from judges
ru: Вы получили ответ от судей

source: You have received a reply from judges in contest %d
ru: Вы получили ответ от судей в турнире %d

source: You should receive an e-mail message with a login and a password to the system. Use this password for the first log in. After the first login you will be able to change the password.
ru: На Ваш электронный адрес будет направлено письмо, которое будет содержать регистрационное имя (login) и пароль для входа в систему. Этот пароль необходимо использовать для первого входа в систему, после чего его можно будет поменять.

source: You should receive an e-mail message with a password to the system. Use this password for the first log in. After the first login you will be able to change the password.
ru: На Ваш электронный адрес будет направлено письмо, которое будет содержать пароль для входа в систему. Этот пароль необходимо использовать для первого входа в систему, после чего его можно будет поменять.

source: Your request has caused an internal server error. Please, report it as a bug.
ru: Ваш запрос вызвал внутреннюю ошибку сервера. Пожалуйста, сообщите об этом как об ошибке.

source: Your submit has been commented
ru: Ваша посылка была прокомментирована

source: Your submit has been commented and accepted
ru: Ваша посылка была прокомментирована и принята

source: Your submit has been commented and ignored
ru: Ваша посылка была прокомментирована и проигнорирована

source: Your submit has been commented and rejected
ru: Ваша посылка была прокомментирована и отклонена

source: Your submit has been commented in contest %d
ru: Ваша посылка была прокомментирована в турнире %d

source: Zip code
ru: Почтовый индекс

source: [Edit current contest]
ru: [Редактировать текущий турнир]

source: `run_id' parameter is undefined
ru: Параметр `run_id' не определён

source: `run_id' parameter value %d is out of range
ru: Значение параметра `run_id' %d за пределами допустимых

source: `run_id' parameter value is invalid.
ru: Номер посылки %d недопустим

source: `run_id' parameter value is out of range
ru: Значение параметра `run_id' за пределами допустимых

source: accepting
ru: приём решений
