Repository: blackav/ejudge
Catalog: ejudge.*.UTF-8.po
Languages: ru

source: %d total tests runs, %d passed, %d failed.
ru: Всего тестов: %d, пройдено: %d, не пройдено: %d.

source: (%d of %d)
ru: (%d из %d)

source: (%d token(s) used)
ru: (использовано: %d)

source: / <b>%d unread message(s)</b>
ru: / <b>%d непрочитанных сообщений</b>

source: or standard input
ru: или стандартный поток ввода

source: or standard output
ru: или стандартный поток вывода

source: (no subject)
ru: (без темы)

source: , REGISTRATION DATA INCOMPLETE
ru: , РЕГИСТРАЦИОННЫЕ ДАННЫЕ НЕПОЛНЫ

source: /&lt;Problem&gt;/&lt;File&gt;
ru: /&lt;Задача&gt;/&lt;Файл&gt;

source: /&lt;Problem&gt;/&lt;User_Id&gt;/&lt;File&gt;
ru: /&lt;Задача&gt;/&lt;Id_Польз.&gt;/&lt;Файл&gt;

source: /&lt;Problem&gt;/&lt;User_Login&gt;/&lt;File&gt;
ru: /&lt;Задача&gt;/&lt;Логин_Польз.&gt;/&lt;Файл&gt;

source: /&lt;Problem&gt;/&lt;User_Name&gt;/&lt;File&gt;
ru: /&lt;Задача&gt;/&lt;Имя_Польз.&gt;/&lt;Файл&gt;

source: /&lt;User_Id&gt;/&lt;File&gt;
ru: /&lt;Id_Польз.&gt;/&lt;Файл&gt;

source: /&lt;User_Id&gt;/&lt;Problem&gt;/&lt;File&gt;
ru: /&lt;Id_Польз.&gt;/&lt;Задача&gt;/&lt;Файл&gt;

source: /&lt;User_Login&gt;/&lt;File&gt;
ru: /&lt;Логин_Польз.&gt;/&lt;Файл&gt;

source: /&lt;User_Login&gt;/&lt;Problem&gt;/&lt;File&gt;
ru: /&lt;Логин_Польз.&gt;/&lt;Задача&gt;/&lt;Файл&gt;

source: /&lt;User_Name&gt;/&lt;File&gt;
ru: /&lt;Имя_Польз.&gt;/&lt;Файл&gt;

source: /&lt;User_Name&gt;/&lt;Problem&gt;/&lt;File&gt;
ru: /&lt;Имя_Польз.&gt;/&lt;Задача&gt;/&lt;Файл&gt;

source: <b>====== Test #%d =======</b>
ru: <b>====== Тест #%d =======</b>

source: <b>Note</b>, that you must log in 24 hours after the form is filled and submitted, or your registration will be cancelled!
ru: <b>Обратите внимание</b>, что Вы должны зайти в систему в течение 24 часов после заполнения и посылки анкеты, или в противном случае Ваша регистрация будет отменена!

source: <b>Note</b>, that you should log in to the system for the first time no later, than in 24 hours after this moment, or the new account is removed.
ru: <b>Обратите внимание</b>, вы должны войти в систему в первый раз не позднее, чем через 24 часа от этого момента, иначе данная учетная запись будет уничтожена.

source: <big>%d total tests runs, %d passed, %d failed.<br/>
ru: <big>Всего тестов: %d, пройдено: %d, не пройдено: %d.<br/>

source: <big>%d total tests runs, %d passed, %d failed.<br>
ru: <big>Всего тестов: %d, пройдено: %d, не пройдено: %d.<br>

source: <big>Failed test: %d.<br/><br/></big>
ru: <big>Ошибка на тесте %d.<br/><br/></big>

source: <big>Failed test: %d.<br><br></big>
ru: <big>Ошибка на тесте %d.<br><br></big>

source: <font color="magenta">Pending</font>
ru: <font color="magenta">Ожидает подтверждения</font>

source: <font color="red">Rejected</font>
ru: <font color="red">Отказано</font>

source: <i>Command line is too long</i>
ru: <i>Командная строка слишком длинна</i>

source: <i>Invalid answer: %d</i>
ru: <i>Недопустимый ответ: %d</i>

source: <i>Not set</i>
ru: <i>Не установлено</i>

source: <li>The contest is closed for participation.</li>
ru: <li>Турнир закрыт для участия.</li>

source: <li>The session was created from a different IP-address or protocol, that yours (%s,%s).</li>
ru: <li>Сессия была создана с другого адреса или по другому протоколу, чем те, которые Вы используете в данный момент (%s,%s).</li>

source: <li>The session was removed by an administrator.</li>
ru: <li>Сессия была удалена администратором системы.</li>

source: <li>The specified session does not exist.</li>
ru: <li>Указанная сессия не существует.</li>

source: <li>The specified session has expired.</li>
ru: <li>Время действия сессии истекло.</li>

source: <li>You are not registered for contest %d.</li>
ru: <li>Вы не зарегистрированы на турнир %d.</li>

source: <li>You are not registered for contest %s.</li>
ru: <li>Вы не зарегистрированы на турнир %s.</li>

source: <li>You do not have permissions to login using the specified role.</li>
ru: <li>У Вас нет прав работать в указанной роли.</li>

source: <li>You have typed an invalid login (<tt>%s</tt>).</li>
ru: <li>Вы ввели неправильное регистрационное имя (<tt>%s</tt>).</li>

source: <li>You have typed an invalid password.</li>
ru: <li>Вы неправильно набрали пароль.</li>

source: <li>You were banned by the administrator.</li>
ru: <li>Ваше участие заблокировано администратором системы.</li>

source: <li>Your IP-address (<tt>%s</tt>) or protocol (<tt>%s</tt>) is banned for participation.</li>
ru: <li>Ваш IP-адрес (<tt>%s</tt>) или протокол (<tt>%s</tt>) закрыт для участия.</li>

source: <li>Your registration was not confirmed.</li>
ru: <li>Ваша регистрация на турнир не подтверждена.</li>

source: <p class="ejudge_copyright">This is <a href="%s"><b>ejudge</b></a> contest administration system, version %s, compiled %s.</p> <p class="ejudge_copyright">This program is copyright &copy; %s Alexander Chernov.</p> <p class="ejudge_copyright">This program is free software; you can redistribute it and/or modify it under the terms of the <a href="http://www.gnu.org/licenses/gpl.html">GNU General Public License</a> as published by the <a href="http://www.fsf.org">Free Software Foundation</a>; either version 2 of the License, or (at your option) any later version.</p> <p class="ejudge_copyright">Visual design and web-interface &copy; %s <a href="%s">Toto Lasvik</a>.</p>
ru: <p class="ejudge_copyright">Это &mdash; система администрирования турниров <a href="%s"><b>ejudge</b></a>, версия %s, дата компиляции %s.</p> <p class="ejudge_copyright">Авторские права на программу: &copy; %s Александр Чернов.</p> <p class="ejudge_copyright">Данная программа является свободным ПО. Вы можете распространять и/или модифицировать её в соответствии с <a href="http://www.gnu.org/licenses/gpl.html">Общей Лицензией GNU</a> (GNU General Public License), опубликованной <a href="http://www.fsf.org">Фондом свободного ПО</a> (Free Software Foundation), либо версии 2 Лицензии, либо (по Вашему желанию) любой последующей версии.</p> <p class="ejudge_copyright">Веб-дизайн и AJAX-интерфейс &copy; %s <a href="%s">Toto Lasvik</a>.</p>

source: <p class="fixed_width">First stage of password recovery is successful. You should receive an e-mail message with further instructions. <b>Note,</b> that you should confirm password recovery in 24 hours, or operation will be cancelled.</p>
ru: <p class="fixed_width">Первый этап восстановления пароля завершен. Теперь Вы должны получить e-mail сообщение с дальнейшими инструкциями. <b>Учтите,</b> что Вы должны завершить процедуру восстановления пароля в течение 24 часов от данного момента, а иначе операция будет отменена.</p>

source: <p class="fixed_width">Password recovery requires several steps. Now, please, specify the <b>login</b> and the <b>e-mail</b>, which was specified when the login was created.</p> <p class="fixed_width">Note, that automatic password recovery is not possible for invisible, banned, locked, or privileged users!</p>
ru: <p class="fixed_width">Восстановление пароля выполняется в несколько этапов. Сейчас, пожалуйста, укажите <b>регистрационное имя</b> и <b>адрес e-mail</b>, который был использован при создании этого регистрационного имени.</p> <p class="fixed_width">Учтите, что автоматическое восстановление пароля невозможно для заблокированных, невидимых и привилегированных пользователей!</p>

source: <p%s>New account <tt>%s</tt> is successfully created. Initial password is generated automatically. You will be able to change your password later.
ru: <p%s>Новая учётная запись <tt>%s</tt> успешно создана. Начальный пароль для входа сгенерирован автоматически. Вы сможете его поменять после входа в систему.

source: <p%s>Page %d of %d.</p>
ru: <p%s>Страница %d из %d.</p>

source: <p><font color="red">At least %d examiners must be assigned.</font></p>
ru: <p><font color="red">Должно быть назначено по крайней мере %d экзаменаторов.</font></p>

source: <p><font color="red">Maximal number for this contest is %d, but already %d are defined.</font></p>
ru: <p><font color="red">Максимальное число участников для этого турнира равно %d, но уже определено %d.</font></p>

source: <p><font color="red">Minimal number for this contest is %d, but only %d are defined.</font></p>
ru: <p><font color="red">Минимальное число членов команды в этом турнире %d, но определено только %d.</font></p>

source: <p>Note, that the exact reason is not reported due to security reasons.</p>
ru: <p>Обратите внимание, что точная причина ошибки не сообщается по соображениям безопасности.</p>

source: <p>To validate your e-mail and enable your participation in this contest you may use the <a href="%s">password restoration</a> service.</p>
ru: <p>Для проверки Вашего адреса e-mail и допуска Вашей регистрационной записи к участию в этом турнире Вы можете воспользоваться сервисом <a href="%s">восстановления паролей</a>.</p>

source: <p>You cannot participate in the contest because your registration is incomplete. Please, %sgo back to the registration forms%s and fill up them correctly.</p>
ru: <p>Вы не можете участвовать в данном турнире потому что Вы не заполнили до конца поля регистрационной анкеты. Пожалуйста, %sвернитесь к заполнению%s регистрационной анкеты.</p>

source: <p>You may define up to %d members.</p>
ru: <p>Вы можете добавить до %d членов команды.</p>

source: <tr%s><td colspan="2">Page %d of %d.</td></tr>
ru: <tr%s><td colspan="2">Страница %d из %d.</td></tr>

source: <u>--- Checker output: file is binary, size %lld ---</u>
ru: <u>--- Вывод проверяющей программы: файл бинарный, размер %lld ---</u>

source: <u>--- Checker output: file is too large, original size %lld ---</u>
ru: <u>--- Вывод проверяющей программы: файл слишком велик, размер %lld ---</u>

source: <u>--- Checker output: size %lld ---</u>
ru: <u>--- Вывод проверяющей программы: размер %lld ---</u>

source: <u>--- Command line arguments ---</u>
ru: <u>--- Аргументы командной строки ---</u>

source: <u>--- Correct: file is binary, size %lld ---</u>
ru: <u>--- Правильный ответ: файл бинарный, размер %lld ---</u>

source: <u>--- Correct: file is too large, original size %lld ---</u>
ru: <u>--- Правильный ответ: файл слишком велик, размер %lld ---</u>

source: <u>--- Correct: size %lld ---</u>
ru: <u>--- Правильный ответ: размер %lld ---</u>

source: <u>--- Input: file is binary, size %lld ---</u>
ru: <u>--- Входные данные: файл бинарный, размер %lld ---</u>

source: <u>--- Input: file is too large, original size %lld ---</u>
ru: <u>--- Входные данные: файл слишком велик, размер %lld ---</u>

source: <u>--- Input: size %lld ---</u>
ru: <u>--- Входные данные: размер %lld ---</u>

source: <u>--- Output: file is binary, size %lld ---</u>
ru: <u>--- Результат работы: файл бинарный, размер %lld ---</u>

source: <u>--- Output: file is too large, original size %lld ---</u>
ru: <u>--- Результат работы: файл слишком велик, размер %lld ---</u>

source: <u>--- Output: size %lld ---</u>
ru: <u>--- Результат работы: размер %lld ---</u>

source: <u>--- Stderr: file is binary, size %lld ---</u>
ru: <u>--- Поток ошибок: файл бинарный, размер %lld ---</u>

source: <u>--- Stderr: file is too large, original size %lld ---</u>
ru: <u>--- Поток ошибок: файл слишком велик, размер %lld ---</u>

source: <u>--- Stderr: size %lld ---</u>
ru: <u>--- Поток ошибок: размер %lld ---</u>

source: A request parameter is invalid. Please, contact the site administrator.
ru: Неверный параметр запроса. Пожалуйста, обратитесь к администратору сайта.

source: ALL PREVIOUS SUBMITS WILL BE LOST!
ru: ВСЕ СДЕЛАННЫЕ ПОСЫЛКИ БУДУТ ОБНУЛЕНЫ!

source: Accepted for testing
ru: Принято на проверку

source: Access denied
ru: В доступе отказано

source: Accounts created using simplified registration procedure cannot be used for participation in contests, which do not allow simplified registration. If you want a regular account, you may create an account using the
ru: Учётные записи, созданные по упрощённой процедуре, не могут быть использованы для участия в турнирах, в которых не поддерживается упрощённая регистрация. Если же Вы хотите создать учётную запись без ограничений на последующее использование, воспользуйтесь опцией

source: Actions
ru: Действия

source: Activate
ru: Активировать

source: Activate new user account
ru: Активировать новую учётную запись

source: Add
ru: Добавить

source: Add CHIEF EXAMINER
ru: Добавить роль ГЛАВНОГО ЭКЗАМЕНАТОРА

source: Add COORDINATOR
ru: Добавить роль КООРДИНАТОРА

source: Add EXAMINER
ru: Добавить роль ЭКЗАМЕНАТОРА

source: Add OBSERVER
ru: Добавить роль НАБЛЮДАТЕЛЯ

source: Add a new run comment
ru: Добавить комментарий к программе

source: Add a new user specifying his/her User Id
ru: Добавить нового пользователя, задавая его User Id

source: Add a new user specifying his/her login
ru: Добавить нового пользователя, задавая его регистрационное имя

source: Add by ID
ru: Добавить по ID

source: Add by login
ru: Добавить по LOGIN

source: Add new
ru: Добавить

source: Add new run
ru: Добавить новую посылку

source: Add new runs in CSV format
ru: Добавить новые записи в CSV-формате

source: Add new user
ru: Добавить нового пользователя

source: Add run
ru: Добавить новую посылку

source: Add runs in CSV format
ru: Добавить записи в CSV-формате

source: Add runs in CSV format!
ru: Добавить записи в CSV-формате!

source: Add the CHIEF EXAMINER role to the selected users
ru: Разрешить работу в роли ГЛАВНОГО ЭКЗАМЕНАТОРА отмеченным пользователям

source: Add the COORDINATOR role to the selected users
ru: Разрешить работу в роли КООРДИНАТОРА отмеченным пользователям

source: Add the EXAMINER role to the selected users
ru: Разрешить работу в роли ЭКЗАМЕНАТОРА отмеченным пользователям

source: Add the OBSERVER role to the selected users
ru: Разрешить работу в роли НАБЛЮДАТЕЛЯ отмеченным пользователям

source: Add users to another group
ru: Добавить пользователей в другую группу

source: Adding new runs
ru: Добавление новых посылок

source: Adding role %d to user %d in contest %d failed
ru: Добавление роли %d пользователю %d в турнире %d не удалось

source: Adding role to user in contest failed
ru: Добавление роли пользователю в турнире не удалось

source: Additional information about this error:
ru: Дополнительная информация об этой ошибке:

source: Additional test information
ru: Доп. инф. о тесте

source: Administrator
ru: Администратор

source: Advisor
ru: Руководитель команды

source: Advisors
ru: Руководители

source: All changes to the old contest will be lost!
ru: Все изменения в старом турнире будут потеряны!

source: All clars
ru: Все сообщения

source: All clars and comments
ru: Все вопросы и комментарии

source: All entries
ru: Все записи

source: Allow
ru: Разрешить

source: Allow edit registration data during contest
ru: Разрешить редактирование регистрационных данных во время турнира

source: Allow viewing full protocol
ru: Разрешить просмотр полного протокола

source: Allow viewing run report
ru: Разрешить просмотр краткого протокола

source: Allow viewing source code
ru: Разрешить просмотр исходного текста

source: Allow viewing the final scores
ru: Разрешить просмотр итогового балла

source: Allow viewing the judge comment of the valuer
ru: Разрешить просмотр комментария для судей, полученного от программы оценивания

source: An e-mail messages is sent to the address <tt>%s</tt>.
ru: Письмо с параметрами Вашей учётной записи выслано на адрес <tt>%s</tt>.

source: An e-mail with your account parameters is sent to address <tt>%s</tt>.
ru: Письмо с параметрами Вашей учётной записи выслано на адрес <tt>%s</tt>.

source: An email message will be sent to you just for your convenience.
ru: Для Вашего удобства Вам будет выслано письмо с регистрационными данными.

source: Answer
ru: Ответ

source: Answer code
ru: Код ответа

source: Answer is empty
ru: Ответ пуст

source: Answer is unspecified
ru: Ответ не задан

source: Answer text
ru: Текст ответа

source: Appeals are disabled
ru: Апелляции отключены

source: Appeals deadline is exceeded
ru: Приём апелляций прекращён

source: Apr
ru: Апр

source: Archive creation with tar failed
ru: При создании архива программой tar произошла ошибка

source: Area
ru: Район

source: Assign automatically
ru: Назначить автоматически

source: Assign chief examiner
ru: Назначить старшего экзаменатора

source: Assign cyphers
ru: Назначить шифры

source: Assign examiner
ru: Назначить экзаменатора

source: Assign manually:
ru: Назначить вручную:

source: Assign random cyphers
ru: Назначить случайный шифр

source: Assigned cyphers
ru: Назначенные шифры

source: Attempt to submit a binary file
ru: Попытка послать бинарный файл

source: Audit log
ru: Журнал аудита

source: Audit log file does not exist
ru: Журнал аудита не существует

source: Audit log is empty
ru: Журнал аудита пуст

source: Aug
ru: Авг

source: Author
ru: Автор

source: Auto-assign logins
ru: Назачить логины автоматически

source: Available
ru: Доступна

source: Available only after contest start
ru: Доступен только после начала турнира

source: Back
ru: Назад

source: Background jobs
ru: Фоновые задания

source: Bad socket name
ru: Неверный путь к сокету

source: Ban
ru: Заблокировать

source: Banned?
ru: Заблокированный?

source: Be careful and type the e-mail address correctly. If you make a mistake, you will not receive a registration e-mail and be unable to complete the registration process.
ru: Будьте внимательны и вводите адрес e-mail правильно. Если Вы ошибётесь, Вы не получите почтовое сообщение с регистрационной информацией и не сможете завершить регистрацию.

source: Binary file is not shown
ru: Бинарный файл

source: Birth Date
ru: Дата рождения

source: COMMIT changes!
ru: СОХРАНИТЬ изменения!

source: Cancel
ru: Отменить

source: Cannot allocate space to store run row %d
ru: Ошибка выделения памяти для сохранения строки %d

source: Cannot calculate the file checksum
ru: Ошибка подсчёта контрольной суммы файла

source: Cannot guess the content type
ru: Невозможно определить тип содержимого

source: Cannot participate
ru: Участие невозможно

source: Cannot read file!
ru: Ошибка чтения файла!

source: Cannot read message text!
ru: Ошибка чтения файла сообщения!

source: Cannot read source text!
ru: Ошибка чтения файла сообщения!

source: Cannot write run row %d
ru: Ошибка записи строки %d

source: Change
ru: Изменить

source: Change Language
ru: Сменить язык

source: Change duration
ru: Изменить длительность

source: Change language
ru: Сменить язык

source: Change password
ru: Сменить пароль

source: Change status
ru: Изменить статус

source: Change tokens for displayed runs
ru: Изменить токены отображённых посылок

source: Change!
ru: Изменить!

source: Changed by user
ru: Сменён пользователем

source: Changing flags of user %d in contest %d failed: %s
ru: Изменение флагов пользователя %d в турнире %d не удалось: %s

source: Changing flags of user in contest failed
ru: Изменение флагов пользователя в турнире не удалось

source: Changing status of user %d in contest %d failed: %s
ru: Изменение статуса пользователя %d в турнире %d не удалось: %s

source: Changing status of user in contest failed
ru: Изменение статуса пользователя в турнире не удалось

source: Charset
ru: Кодировка

source: Check again
ru: Проверить еще раз

source: Check contest settings
ru: Проверить настройки турнира

source: Check failed
ru: Ошибка проверяющей системы

source: Check failed runs
ru: Посылки с ошибкой проверяющей системы

source: Checker output
ru: Вывод проверяющей программы

source: Chief examiner
ru: Главный экзаменатор

source: Chief examiner must be assigned.
ru: Должен быть назначен главный экзаменатор.

source: Choose an answer
ru: Варианты ответа

source: City
ru: Город

source: City (En)
ru: Город (Англ.)

source: Clar ID
ru: Номер сообщения

source: Clar log update failed
ru: Обновление журнала посылок не удалось

source: Clarification
ru: Сообщение

source: Clarification requests are disabled
ru: Сообщения отключены

source: Clars
ru: Сообщения

source: Clars to all
ru: Сообщения всем участникам

source: Clear
ru: Очистить

source: Clear BANNED
ru: Сбросить флаг BANNED

source: Clear DISQUALIFIED flag
ru: Сбросить флаг ДИСКВАЛИФИКАЦИИ

source: Clear INCOMPLETE
ru: Сбросить флаг НЕПОЛНОТЫ

source: Clear INVISIBLE
ru: Сбросить флаг НЕВИДИМОСТИ

source: Clear LOCKED
ru: Сбросить флаг LOCKED

source: Clear contest passwords
ru: Сбросить турнирные пароли

source: Clear contest passwords!
ru: Сбросить турнирные пароли!

source: Clear displayed runs
ru: Очистить отображённые посылки

source: Clear displayed runs!
ru: Очистить отображённые посылки!

source: Clear disqualification
ru: Сбросить дисквалификацию

source: Clear finished flag
ru: Сбросить флаг проверенности решений

source: Clear runs
ru: Очистить посылки

source: Clear the BANNED flag for the selected users
ru: Сбросить флаг БЛОКИРОВКИ у отмеченных пользователей

source: Clear the DISQUALIFIED flag for the selected users
ru: Сбросить флаг ДИСКВАЛИФИКАЦИИ у отмеченных пользователей

source: Clear the INCOMPLETE flag for the selected users
ru: Сбросить флаг НЕПОЛНОТЫ у отмеченных пользователей

source: Clear the INVISIBLE flag for the selected users
ru: Сбросить флаг НЕВИДИМОСТИ у отмеченных пользователей

source: Clear the LOCKED flag for the selected users
ru: Сбросить еще один флаг

source: Clear this entry
ru: Очистить эту запись

source: Clear variants
ru: Очистить варианты

source: Client's requests are suspended. Please wait until the contest administrator resumes the contest
ru: Запросы участников временно не обрабатываются. Пожалуйста, подождите, пока турнир не будет продолжен

source: Close
ru: Закрыть

source: Coach
ru: Тренер

source: Coaches
ru: Тренеры

source: Coding style violation
ru: Нарушение правил оформления программ

source: Column name %s is already defined as column %d
ru: Столбец %s уже определен как столбец с номером %d

source: Command-line parameters
ru: Параметры командной строки

source: Comment
ru: Комментарий

source: Comment for other judges (optional)
ru: Комментарии для других судей (не обязательно)

source: Compare
ru: Сравнить

source: Compare this run with run
ru: Сравнить эту посылку с посылкой

source: Compilation error
ru: Ошибка компиляции

source: Compiled
ru: Скомпилировано

source: Compiler options
ru: Опции компиляторов

source: Compiler output
ru: Вывод компилятора

source: Compiler/style checker output
ru: Вывод компилятора и программы проверки стиля

source: Compiling and running
ru: Компилируется и тестируется

source: Compiling...
ru: Компилируется...

source: Compose a message to all participants
ru: Написать сообщение всем участникам

source: Configuration error
ru: Ошибка конфигурации

source: Confirm action
ru: Подтвердить выполнение

source: Confirm registration
ru: Подтвердить регистрацию

source: Conflicting user_id (%d) and user_login (%s)
ru: Конфликтуют user_id (%d) и user_login (%s)

source: Conflicting user_id and user_login
ru: Конфликтуют user_id и user_login

source: Connection failed
ru: Подключение завершилось неудачно

source: Content type
ru: Тип содержимого

source: Content type %s is disabled for problem %s in row %d
ru: Тип файла %s запрещён для задачи %s в строке %d

source: Content type %s is not enabled for problem %s in row %d
ru: Тип файла %s не разрешён для задачи %s в строке %d

source: Content type <tt>%s</tt> is disabled for this problem
ru: Тип файла <tt>%s</tt> запрещен для этой задачи

source: Content type <tt>%s</tt> is not available for this problem
ru: Тип файла <tt>%s</tt> недоступен для этой задачи

source: Content type is disabled for this problem
ru: Этот тип файла запрещен для этой задачи

source: Content type is not available for this problem
ru: Этот файла недоступен для этой задачи

source: Contest
ru: Турнир

source: Contest Flags
ru: Флаги турнира

source: Contest ID
ru: ID турнира

source: Contest already finished
ru: Турнир уже завершён

source: Contest already started
ru: Турнир уже запущен
