Repository: blackav/ejudge
Catalog: ejudge.*.UTF-8.po
Languages: ru

source: Contest configuration directory
ru: Каталог с конфигурацией турнира

source: Contest directory
ru: Каталог турнира

source: Contest is not finished
ru: Турнир ещё не закончился

source: Contest is not started
ru: Турнир не начался

source: Contest is not stopped
ru: Турнир не закончился

source: Contest is ready for testing
ru: Турнир готов к тестированию

source: Contest is unloaded
ru: Обслуживание турнира прервано

source: Contest load time
ru: Время загрузки турнира

source: Contest management
ru: Управление турниром

source: Contest name
ru: Название турнира

source: Contest not available
ru: Турнир недоступен

source: Contest password
ru: Турнирный пароль

source: Contest passwords
ru: Турнирные пароли

source: Contest passwords are disabled
ru: Турнирные пароли отключены

source: Contest priority
ru: Приоритет турнира

source: Contest registrations
ru: Регистрация на турниры

source: Contest selection
ru: Выбор турнира

source: Contest settings
ru: Настройки турнира

source: Contest start date
ru: Время начала турнира

source: Contest start time
ru: Время начала турнира

source: Contest status
ru: Состояние турнира

source: Contest time
ru: Продолжительность турнира

source: Contest update time
ru: Время обновления турнира

source: Contest: %d (%s)
ru: Турнир: %d (%s)

source: Contestant
ru: Основной участник

source: Contestants
ru: Основные участники

source: Continue
ru: Продолжить

source: Continue in this session
ru: Продолжить в данной сессии

source: Continue suspended editing
ru: Продолжить приостановленное редактирование

source: Coordinator
ru: Координатор

source: Copy
ru: Скопировать

source: Correct answer
ru: Правильный ответ

source: Correct output
ru: Правильный ответ

source: Country
ru: Страна

source: Country (En)
ru: Страна (Англ.)

source: Create account
ru: Создать учётную запись

source: Create another account
ru: Создать ещё одну учётную запись

source: Create contest!
ru: Создать турнир!

source: Create user account
ru: Создать новую учётную запись

source: Current standings
ru: Текущее положение участников

source: Cypher
ru: Шифр

source: Cypher is empty in row %d
ru: Шифр пуст в строке %d

source: Cypher prefix
ru: Префикс шифра

source: DB time
ru: Отметка времени БД

source: DB timestamp
ru: Отметка времени в БД

source: DISQUALIFY users
ru: ДИСКВАЛИФИЦИРОВАТЬ пользователей

source: Database error
ru: Ошибка базы данных

source: Date penalty
ru: Штраф по дате сдачи

source: Deactivate
ru: Деактивировать

source: Deadline
ru: Срок сдачи

source: Deadline for this problem is expired
ru: Срок сдачи данной задачи истёк

source: Dec
ru: Дек

source: Default
ru: Значение по умолчанию

source: Default value
ru: Значение по умолчанию

source: Del CHIEF EXAMINER
ru: Удалить роль ГЛАВНОГО ЭКЗАМЕНАТОРА

source: Del COORDINATOR
ru: Удалить роль КООРДИНАТОРА

source: Del EXAMINER
ru: Удалить роль ЭКЗАМЕНАТОРА

source: Del OBSERVER
ru: Удалить роль НАБЛЮДАТЕЛЯ

source: Delete
ru: Удалить

source: Delete all
ru: Удалить все

source: Delete row
ru: Удалить строку

source: Delete!
ru: Удалить!

source: Deleting role %d of user %d from contest %d failed
ru: Удаление роли %d у пользователя %d в турнире %d не удалось

source: Deleting role of user from contest failed
ru: Удаление роли у пользователя в турнире не удалось

source: Deny
ru: Отказать

source: Desired EOLN Type
ru: Желаемый тип концов строк

source: Detailed information about participant
ru: Подробная информация об участнике

source: Detailed information for user (team)
ru: Подробная информация о пользователе (команде)

source: Details
ru: Детали

source: Details for user
ru: Подробная информация о пользователе

source: Directory structure
ru: Структура каталогов

source: Disable &quot;Name&quot; field
ru: Запретить поле &quot;Имя&quot;

source: Disable clarifications
ru: Запретить отправку участниками сообщений

source: Disable locale change
ru: Запретить смену языка интерфейса

source: Disable password change
ru: Запретить смену пароля

source: Disable separate team password
ru: Запретить турнирные пароли

source: Disable team member deletion
ru: Запретить удаление членов команды

source: Disabled
ru: Запрещен

source: Discipline
ru: Учебная дисциплина

source: Disk read error (nonexistant file?)
ru: Ошибка чтения с диска (файл не существует?)

source: Disk write error (disk full?)
ru: Ошибка записи на диск (закончилось место?)

source: Disqualification explanation
ru: Объяснение причины дисквалификации

source: Disqualified
ru: Дисквалифицирован

source: Disqualified runs
ru: Дисквалифицированные посылки

source: Disqualified?
ru: Дисквалифицирован?

source: Disqualify
ru: Дисквалифицировать

source: Disqualify displayed runs
ru: Дисквалифицировать отображённые посылки

source: Disqualify displayed runs!
ru: Дисквалифицировать отображённые посылки!

source: Disqualify runs
ru: Дисквалифицировать посылки

source: Disqualify selected users
ru: Дисквалифицировать отмеченных участников

source: Disqualify user
ru: Дисквалифицировать участника

source: Do not show before the contest starts?
ru: Не показывать до начала турнира?

source: Down all
ru: Вниз все

source: Download OK and PR runs
ru: Загрузить только посылки в статусе OK и PR

source: Download OK runs
ru: Загрузить только успешные посылки

source: Download OK, PR, RJ, IG, PD, DQ runs
ru: Загрузить только посылки в статусах OK, PR, RJ, IG, PD, DQ

source: Download all runs
ru: Загрузить все посылки

source: Download archive of runs
ru: Загрузить архив посылок

source: Download run
ru: Загрузить посылку

source: Download runs
ru: Загрузить посылки

source: Download runs configuration
ru: Конфигурация загружаемых посылок

source: Download selected runs
ru: Загрузить выбранные посылки

source: Dump data
ru: Выгрузить данные

source: Dump runs in CSV format
ru: Вывести базу посылок в CSV-формате

source: Dump users in CSV format
ru: Вывести базу пользователей в CSV-формате

source: Duration
ru: Продолжительность

source: E-mail
ru: Адрес электронной почты

source: E-mail contains invalid characters
ru: Поле "E-mail" содержит недопустимые символы

source: E-mail is not specified
ru: Поле "E-mail" не заполнено

source: EMPTY
ru: ПУСТО

source: EOLN Type
ru: Тип концов строк

source: EXAM IS RUNNING (frozen)
ru: ЭКЗАМЕН ИДЁТ (заморозка)

source: Edit
ru: Редактировать

source: Edit comment
ru: Изменить комментарий

source: Editing clar
ru: Редактирование сообщения

source: Editing general info
ru: Редактирование общей информации

source: Editing member info
ru: Редактирование участников

source: Editing run
ru: Редактирование сообщения

source: Elapsed time
ru: Прошедшее время

source: Empty
ru: не заполнено

source: Empty submit
ru: Пустая посылка

source: Empty text of warning
ru: Текст предупреждения пуст

source: Enable password restoration
ru: Разрешить восстановление пароля

source: Enable simple registration (no email)
ru: Разрешить упрощенную регистрацию (без e-mail)

source: End time
ru: Время окончания

source: Enqueue Time
ru: Время постановки

source: Error
ru: Ошибка

source: Error details follow
ru: Детали ошибки приведены ниже

source: Error during run comparison
ru: Ошибка при сравнении программ

source: Exam Id
ru: N экз. листа

source: Exam finish time
ru: Время окончания экзамена

source: Exam start time
ru: Время начала экзамена

source: Exam status
ru: Состояние экзамена

source: Examination information
ru: Информация об экзаменуемых

source: Examination mode
ru: Режим экзамена

source: Examiner
ru: Экзаменатор

source: Examiners
ru: Экзаменаторы

source: Examiners assignments
ru: Распределение экзаменаторов

source: Examples
ru: Примеры

source: Exit code
ru: Код завершения

source: Export runs in XML external format
ru: Сохранить журнал посылок во внешнем XML-формате

source: External ID
ru: Внешний ID

source: Extra info
ru: Доп. информация

source: Faculty
ru: Факультет

source: Faculty (En)
ru: Факультет (Англ.)

source: Faculty (abbreviated)
ru: Факультет (аббревиатура)

source: Faculty (abbreviated) (En)
ru: Факультет (аббревиатура) (Англ.)

source: Faculty (short)
ru: Факультет (сокр.)

source: Faculty (short) (En)
ru: Факультет (сокр.) (Англ.)

source: Failed test
ru: Ошибка на тесте

source: Failed to add row %d to runlog
ru: Ошибка добавления строки %d в базу

source: Failed to fetch run log entry
ru: Ошибка чтения записи о посылке с диска

source: Failed to fetch run log entry %d
ru: Ошибка чтения записи о посылке %d с диска

source: Family name
ru: Фамилия

source: Family name (En)
ru: Фамилия (Англ.)

source: Feb
ru: Фев

source: Female
ru: Женский

source: Field "%s" contains non-printable characters.
ru: Поле "%s" содержит неотображаемые символы.

source: Field "Name" contains non-printable characters
ru: Поле "Имя" содержит неотображаемые символы

source: Field 0
ru: Поле 0

source: Field 1
ru: Поле 1

source: Field 2
ru: Поле 2

source: Field 3
ru: Поле 3

source: Field 4
ru: Поле 4

source: Field 5
ru: Поле 5

source: Field 6
ru: Поле 6

source: Field 7
ru: Поле 7

source: Field 8
ru: Поле 8

source: Field 9
ru: Поле 9

source: File
ru: Файл

source: File is empty
ru: Файл пуст

source: File is not specified
ru: Файл не задан

source: File name pattern
ru: Шаблон имени файла

source: Filter expression
ru: Условие отбора

source: Filter expression errors
ru: Ошибки в фильтре

source: Filtered
ru: Отобрано

source: Final test visibility rules
ru: Финальные правила видимости тестов

source: Final visibility rules are active
ru: Финальные правила видимости тестов активны

source: Finish session
ru: Завершить сеанс работы

source: Finish the exam
ru: Завершить экзамен

source: Finish time
ru: Время окончания

source: First User_Id
ru: Первый User_Id

source: First clar
ru: Первое сообщение

source: First name
ru: Имя

source: First name (En)
ru: Имя (Англ.)

source: First run
ru: Первая посылка

source: Flags
ru: Флаги

source: Force contest registration
ru: Регистрировать на турнир принудительно

source: Force start virtual contest
ru: Начать виртуальный турнир

source: Force virtual contest start for the selected users
ru: Начать виртуальный турнир для отмеченных пользователей

source: Forget changes
ru: Забыть изменения

source: Forget editing
ru: Забыть редактирование

source: Forget it
ru: Забыть это

source: Forgot password?
ru: Забыли пароль?

source: Formatting rules violation
ru: Нарушение правил оформления программ

source: Free registration
ru: Свободная регистрация

source: Freeze contest standings
ru: Не обновлять таблицу результатов

source: From
ru: От

source: From scratch
ru: С нуля

source: Full path
ru: Полный путь

source: Full rejudge displayed runs
ru: Полностью перепроверить отображённые посылки

source: Full score
ru: Полный балл

source: Fully rejudge displayed runs
ru: Полностью перепроверить отображённые посылки

source: Fully rejudge displayed runs!
ru: Полностью перепроверить отображённые посылки!

source: Fully rejudge runs
ru: Полностью перепроверить посылки

source: Further testing information is not available
ru: Дальнейшая информация о тестировании отсутствует

source: Gender
ru: Пол

source: General info
ru: Общая информация

source: General information
ru: Общая информация

source: General registration form fields
ru: Общие поля регистрационной анкеты

source: General settings (contest.xml)
ru: Общие настройки (contest.xml)

source: Generate contest passwords
ru: Перегенерировать турнирные пароли

source: Generate random contest passwords
ru: Сгенерировать случайные турнирные пароли

source: Generate random contest passwords!
ru: Сгенерировать случайные турнирные пароли!

source: Generate random registration passwords
ru: Сгенерировать случайные регистрационные пароли

source: Generate random registration passwords!
ru: Сгенерировать случайные регистрационные пароли!

source: Generate registration passwords
ru: Перегенерировать регистрационные пароли

source: Global settings (serve.cfg)
ru: Глобальные настройки (serve.cfg)

source: Good!
ru: Отлично!

source: Grade
ru: Уровень (класс, курс)

source: Group
ru: Группа (класс)

source: Group (En)
ru: Группа (класс) (Англ.)

source: Guest
ru: Гость

source: Guests
ru: Гости

source: Hash value
ru: Хэш-код

source: Header row defines %d columns, but row %d has %zu columns
ru: Заголовок определяет %d столбцов, а строка %d содержит %zu столбцов

source: Hello, New random password was successfully generated!
ru: Здравствуйте, Новый случайный пароль успешно сгененирован!

source: Hello, Somebody (probably you) has registered a new account to participate in contest "%Cn"%V1 using this e-mail address (%Ue). Registration has completed successfully. This message contains your login and password for your convenience. login: %Ul password: %Uz URL: %Vu Regards, The ejudge contest administration system (www.ejudge.ru)
ru: Здравствуйте! Кто-то (возможно и Вы) указал этот адрес (%Ue) при регистрации нового пользователя для участия в турнире "%Cn"%V1. Регистрация успешно завершена. Данное письмо содержит Ваше регистрационное имя и пароль и послано Вам для Вашего удобства. регистрационное имя: %Ul пароль: %Uz URL персональной страницы: %Vu С уважением, Система проведения турниров ejudge (www.ejudge.ru)

source: Hello, Somebody (probably you) have requested registration password regeneration for login `%s'.
ru: Здравствуйте, Кто-то (возможно и Вы) запросил перегенерацию регистрационного пароля для регистрационного имени `%s'.

source: Hello, Somebody (probably you) have specified this e-mail address (%Ue) when registering an account on the %Vn%V1. To confirm registration, you should enter the provided login and password on the login page of the server at the following url: %Vu. Note, that if you do not do this in 24 hours from the moment of sending this letter, registration will be void. login: %Ul password: %Uz Regards, The ejudge contest administration system (www.ejudge.ru)
ru: Здравствуйте! Кто-то (возможно и Вы) указал этот адрес (%Ue) при регистрации на сервере "%Vn"%V1. Чтобы подтвердить регистрацию, Вам нужно будет ввести предоставленные в этом письме регистрационное имя и пароль при входе в систему по адресу: %Vu. Обратите внимание, что если Вы не сделаете этого в течение 24 часов с момента отсылки данного письма, регистрация будет аннулирована. регистрационное имя: %Ul пароль: %Uz С уважением, Система проведения турниров ejudge (www.ejudge.ru)

source: Hello, Somebody (probably you) have specified this e-mail address (%Ue) when registering an account to participate in "%Cn"%V1. To confirm registration, you should enter the provided login and password on the login page of the server at the following url: %Vu. Note, that if you do not do this in 24 hours from the moment of sending this letter, registration will be void. login: %Ul password: %Uz Regards, The ejudge contest administration system (www.ejudge.ru)
ru: Здравствуйте! Кто-то (возможно и Вы) указал этот адрес (%Ue) при регистрации для участия в турнире "%Cn"%V1. Чтобы подтвердить регистрацию, Вам нужно будет ввести предоставленные в этом письме регистрационное имя и пароль при входе в систему по адресу: %Vu. Обратите внимание, что если Вы не сделаете этого в течение 24 часов с момента отсылки данного письма, регистрация будет аннулирована. регистрационное имя: %Ul пароль: %Uz С уважением, Система проведения турниров ejudge (www.ejudge.ru)

source: Hello, User `%s' (email %s) completed password regeneration in contest %d from IP %s
ru: Здравствуйте, Пользователь `%s' (email %s) завершил процедуру перегенерации регистрационного пароля в турнире %d с IP-адреса %s

source: Hello, User `%s' (email %s) has initiated password regeneration in contest %d from IP %s
ru: Здравствуйте, Пользователь `%s' (email %s) начал процедуру перегенерации регистрационного пароля в турнире %d с IP-адреса %s

source: Help
ru: Помощь

source: Hidden?
ru: Скрыт?

source: Hide closed contests
ru: Скрыть закрытые турниры

source: Hide compiler options
ru: Скрыть опции компиляторов

source: Hide details
ru: Скрыть детали

source: Hide extended info
ru: Скрыть расширенную информацию

source: Hide hidden contests
ru: Скрыть скрытые турниры

source: Hide unmanageable contests
ru: Скрыть неуправляемые турниры

source: Homepage
ru: Личная страница WEB

source: IP address
ru: IP-адрес

source: IP addresses
ru: IP-адреса

source: IP addresses for users
ru: IP-адреса пользователей

source: IPC operation failed
ru: операция IPC завершилась с ошибкой

source: If you already have an ejudge account on this server, you may use it. If so, follow the link
ru: Если у Вас уже есть учётная запись в системе ejudge на этом сервере, Вы можете использовать её. Для этого проследуйте по ссылке

source: Ignore displayed runs
ru: Игнорировать отображённые посылки

source: Ignore displayed runs!
ru: Игнорировать отображённые посылки!

source: Ignore runs
ru: Игнорировать посылки

source: Ignored
ru: Проигнорирована

source: Ignoring empty column %d
ru: Пустой столбец %d игнорируется

source: Ignoring unsupported column %d (%s)
ru: Неподдерживаемый столбец %d (%s) игнорируется

source: Imported?
ru: Импортирована?

source: In order to complete the registration procedure, hit the "Confirm registration" link.
ru: Для завершения процедуры регистрации нажмите ссылку "Подтвердить регистрацию".

source: In reply to
ru: В ответ на

source: Incomplete?
ru: Неполная регистрация?

source: Info
ru: Инфо

source: Information about run
ru: Информация о попытке

source: Information by your request is not available.
ru: Информация по Вашему запросу отсутствует

source: Information is not available
ru: Информация отсутствует

source: Information is not available.
ru: Информация недоступна.

source: Input
ru: Входные данные

source: Input file name
ru: Имя входного файла

source: Input format
ru: Формат входных данных

source: Input in
ru: Входные данные в файле

source: Institution
ru: Учебное заведение

source: Institution (En)
ru: Учебное заведение (Англ.)

source: Institution (abbreviated)
ru: Учебное заведение (аббревиатура)

source: Institution (abbreviated) (En)
ru: Учебное заведение (аббревиатура) (Англ.)

source: Institution (short)
ru: Учебное заведение (сокр.)

source: Institution (short) (En)
ru: Учебное заведение (сокр.) (Англ.)

source: Institution entry date
ru: Дата поступления в учебное заведение

source: Institution graduation date
ru: Дата окончания учебного заведения

source: Institution number
ru: Номер учебного заведения

source: Instructions
ru: Инструкции

source: Insufficient duration to continue the contest
ru: Недостаточная продолжительность турнира

source: Internal error
ru: Внутренняя ошибка

source: Invalid RunId %s in row %d
ru: Недопустимое значени RunId %s в строке %d

source: Invalid UId %s in row %d
ru: Недопустимое значение UId %s в строке %d

source: Invalid action
ru: Неверная команда

source: Invalid character
ru: Недопустимый символ

source: Invalid characters
ru: Недопустимые символы

source: Invalid clar_id
ru: Неверный идентификатор сообщения

source: Invalid configuration
ru: Неверная конфигурация

source: Invalid contest
ru: Неверный турнир

source: Invalid cypher `%s' in row %d
ru: Недопустимый шифр `%s' в строке %d

source: Invalid directory structure type
ru: Неверный тип структуры каталогов

source: Invalid duration specification
ru: Неверная спецификация продолжительности турнира

source: Invalid error code
ru: Неверный код ошибки

source: Invalid file name
ru: Неверное имя файла

source: Invalid filter expression
ru: Неверное условие отбора

source: Invalid language
ru: Неверный идентификатор языка программирования

source: Invalid language `%s' in row %d
ru: Недопустимый язык `%s' в строке %d

source: Invalid locale_id
ru: Неверный идентификатор языка

source: Invalid login
ru: Неверное регистрационное имя

source: Invalid login `%s' in row %d
ru: Недопустимое регистрационное имя `%s' в строке %d

source: Invalid name `%s' in row %d
ru: Недопустимое имя `%s' в строке %d

source: Invalid pages count
ru: Неверное количество страниц

source: Invalid parameter
ru: Неверный параметр

source: Invalid problem
ru: Неверная задача

source: Invalid problem `%s' in row %d
ru: Недопустимая задача `%s' в строке %d

source: Invalid problem in run %d in row %d
ru: Недопустимая задача в посылке %d в строке %d

source: Invalid role
ru: Неверная роль пользователя

source: Invalid run selection type
ru: Неверный тип выбора посылок

source: Invalid run to compare to
ru: Неверный номер посылки для сравнения

source: Invalid score
ru: Неверные баллы

source: Invalid score adjustment
ru: Неверная поправка баллов

source: Invalid session
ru: Неверный идентификатор сессии.

source: Invalid session identifier. The possible reasons are as follows.
ru: Неверный идентификатор сессии. Возможные причины этой ошибки перечислены ниже.

source: Invalid status
ru: Недопустимый статус

source: Invalid status `%s' (%d) in row %d
ru: Недопустимый статус `%s' (%d) в строке %d

source: Invalid status `%s' in row %d
ru: Недопустимый статус `%s' в строке %d

source: Invalid test
ru: Неверный тест

source: Invalid text of warning
ru: Текст предупреждения недопустим

source: Invalid text of warning comment
ru: Неверный текст комментария к предупреждению

source: Invalid time specification
ru: Неверная спецификация времени

source: Invalid user role
ru: Неверная роль пользователя

source: Invalid user_id
ru: Неверный идентификатор пользователя

source: Invalid user_login
ru: Неверное регистрационное имя пользователя

source: Invalid variant
ru: Неверный вариант

source: Invisible?
ru: Невидимый?

source: Issue a warning
ru: Выдать предупреждение

source: Issue warning
ru: Выдать предупреждение

source: It's not allowed to answer to judge's messages
ru: Нельзя отвечать на сообщения судей

source: Jan
ru: Янв

source: Judge
ru: Судья

source: Judge scores are opened
ru: Финальные баллы открыты

source: Judge suspended runs
ru: Проверить отложенные посылки

source: Judge suspended runs!
ru: Проверить отложенные посылки!

source: Judge's comment
ru: Комментарий для судей

source: Judge's report
ru: Судейский протокол

source: Judging priorities
ru: Приоритет проверки

source: Jul
ru: Июль

source: Jump to contest
ru: Перейти к турниру

source: Jump to group
ru: Перейти к группе

source: Jun
ru: Июнь

source: Just OK the run
ru: Просто пометить посылку OK

source: Just ignore the run
ru: Просто проигнорировать посылку

source: Keywords
ru: Ключевые слова

source: Language
ru: Язык

source: Language %s is disabled for problem %s in row %d
ru: Язык программирования %s запрещён для задачи %s в строке %d

source: Language %s is disabled in row %d
ru: Язык программирования %s запрещён в строке %d

source: Language %s is not enabled for problem %s in row %d
ru: Язык программирования %s не разрешён для задачи %s в строке %d

source: Language column is undefined
ru: Столбец "Язык" не определен

source: Language is empty in row %d
ru: В строке %d не определён язык

source: Language settings (serve.cfg)
ru: Настройки языков программирования (serve.cfg)

source: Last User_Id (incl.)
ru: Последний User_Id (вкл.)

source: Last clar
ru: Последнее сообщение

source: Last login time
ru: Время последнего входа в турнир

source: Last run
ru: Последняя посылка

source: Last submit
ru: Последняя посылка

source: Last success
ru: Последняя успешная сдача

source: Link
ru: Ссылка

source: Links
ru: Ссылки

source: List of registered participants
ru: Список зарегистрировавшихся участников

source: Locale ID
ru: Идентификатор языка

source: Locale code
ru: Идентификатор языка

source: Location
ru: Размещение

source: Lock
ru: Закрыть

source: Locked?
ru: Запертый?

source: Log in
ru: Войти

source: Log in to edit registration data
ru: Войти и редактировать регистрационные данные

source: Login contains invalid characters
ru: Поле "Регистрационное имя" содержит недопустимые символы
