Repository: blackav/ejudge
Catalog: trunk/ejudge/checkers/ejudgecheckers.*.UTF-8.po
Languages: ru_ru

source: %s: %d: end-of-line expected
ru_ru: %s: %d: ожидался конец строки

source: %s: %d: invalid control character with code %d
ru_ru: %s: %d: недопустимый управляющий символ с кодом %d

source: %s: %s: input error
ru_ru: %s: %s: ошибка ввода

source: %s: `-' before uint32 value
ru_ru: %s: знак '-' перед 32-битным беззнаковым целым (uint32) значением

source: %s: `-' before uint64 value
ru_ru: %s: знак '-' перед 64-битным беззнаковым целым (uint64) значением

source: %s: cannot open %s for reading
ru_ru: %s: ошибка открытия %s для чтения

source: %s: cannot parse double value
ru_ru: %s: ошибка конвертации в значение типа double

source: %s: cannot parse int32 value
ru_ru: %s: ошибка конвертации в 32-битное целое (int32) значение

source: %s: cannot parse int64 value
ru_ru: %s: ошибка конвертации в 64-битное целое (int64) значение

source: %s: cannot parse long double value
ru_ru: %s: ошибка конвертации в значение типа long double

source: %s: cannot parse uint32 value
ru_ru: %s: ошибка конвертации в 32-битное беззнаковое целое (uint32) значение

source: %s: cannot parse uint64 value
ru_ru: %s: ошибка конвертации в 64-битное беззнаковое целое (uint64) значение

source: %s: double value is out of range
ru_ru: %s: число не попадает в диапазон типа double

source: %s: end-of-line expected
ru_ru: %s: ожидался конец строки

source: %s: garbage where EOF expected
ru_ru: %s: мусорный вывод там, где ожидался конец файла

source: %s: input element is too long
ru_ru: %s: элемент ввода имеет слишком большую длину

source: %s: input error
ru_ru: %s: ошибка ввода

source: %s: input error while seeking EOLN
ru_ru: %s: ошибка ввода при поиске символа конца строки в файле

source: %s: int32 value is out of range
ru_ru: %s: число не попадает в диапазон 32-битных целых (int32) значений

source: %s: int64 value is out of range
ru_ru: %s: число не попадает в диапазон 64-битных целых (int64) значений

source: %s: invalid arguments
ru_ru: %s: недопустимый аргумент

source: %s: invalid control character %d
ru_ru: %s: недопустимый управляющий символ с кодом %d

source: %s: invalid control character with code %d
ru_ru: %s: недопустимый управляющий символ с кодом %d

source: %s: long double value is out of range
ru_ru: %s: число не попадает в диапазон типа long double

source: %s: no double value
ru_ru: %s: ожидалось значение типа double

source: %s: no int32 value
ru_ru: %s: ожидалось 32-битное целое (int32) значение

source: %s: no int64 value
ru_ru: %s: ожидалось 64-битное целое (int32) значение

source: %s: no long double value
ru_ru: %s: ожидалось значение типа long double

source: %s: no uint32 value
ru_ru: %s: ожидалось 32-битное беззнаковое целое (uint32) значение

source: %s: no uint64 value
ru_ru: %s: ожидалось 64-битное беззнаковое целое (uint64) значение

source: %s: uint32 value is out of range
ru_ru: %s: число не попадает в диапазон 32-битных беззнаковых целых (uint32) значений

source: %s: uint64 value is out of range
ru_ru: %s: число не попадает в диапазон 64-битных беззнаковых целых (uint64) значений

source: %s: unexpected EOF
ru_ru: %s: неожиданный конец файла

source: %s: unexpected EOF while seeking EOLN
ru_ru: %s: неожиданный конец файла при поиске символа конца строки в файле

source: Answers differ: %s: output: %.10g, correct: %.10g
ru_ru: Несовпадение ответов: %s: вывод: %.10g, эталон: %.10g

source: Answers differ: %s: output: %.15Lg, correct: %.15Lg
ru_ru: Несовпадение ответов: %s: вывод: %.15Lg, эталон: %.15Lg

source: Answers differ: %s: output: %d, correct: %d
ru_ru: Несовпадение ответов: %s: вывод: %d, эталон: %d

source: Answers differ: %s: output: %lld, correct: %lld
ru_ru: Несовпадение ответов: %s: вывод: %lld, эталон: %lld

source: Answers differ: %s: output: %llu, correct: %llu
ru_ru: Несовпадение ответов: %s: вывод: %llu, эталон: %llu

source: Answers differ: %s: output: %u, correct: %u
ru_ru: Несовпадение ответов: %s: вывод: %u, эталон: %u

source: Answers do not match
ru_ru: Несовпадение ответов

source: Answers do not match: output: %.10Lg, correct: %.10Lg
ru_ru: Несовпадение ответов: вывод: %.10Lg, эталон: %.10Lg

source: Answers do not match: output: %.10g, correct: %.10g
ru_ru: Несовпадение ответов: вывод: %.10g, эталон: %.10g

source: Answers do not match: output: %d, correct: %d
ru_ru: Несовпадение ответов: вывод: %d, эталон: %d

source: Answers do not match: output: %lld, correct: %lld
ru_ru: Несовпадение ответов: вывод: %lld, эталон: %lld

source: Answers do not match: output: %llu, correct: %llu
ru_ru: Несовпадение ответов: вывод: %llu, эталон: %llu

source: Answers do not match: output: %u, correct: %u
ru_ru: Несовпадение ответов: вывод: %u, эталон: %u

source: Cannot open correct output file '%s'
ru_ru: Ошибка открытия эталонного файла '%s'

source: Cannot open input directory '%s'
ru_ru: Ошибка открытия каталога входных данных '%s'

source: Cannot open input file '%s'
ru_ru: Ошибка открытия входного файла '%s'

source: Cannot open output directory '%s'
ru_ru: Ошибка открытия каталога с результатом работы '%s'

source: Cannot open output file '%s'
ru_ru: Ошибка открытия выходного файла '%s'

source: Cannot parse EPS value
ru_ru: Ошибка в записи значения переменной окружения EPS

source: Cannot read test count
ru_ru: Ошибка при чтении общего числа тестов

source: Cannot read test description %d
ru_ru: Ошибка при чтении дескриптора теста %d

source: Correct answer is neither `yes' nor `no' (case insensitive)
ru_ru: Эталонный ответ не является ни строкой 'yes', ни строкой 'no' (без учета регистра букв)

source: Difference at byte %zu: output: %d, correct: %d
ru_ru: Различие в байте %zu: вывод: %d, эталон: %d

source: Different number of lines: output: %zu, correct: %zu
ru_ru: Различие количестве строк: вывод: %zu, эталон: %zu

source: Different size: output: %zu, correct: %zu
ru_ru: Различие в размере: вывод: %zu, эталон: %zu

source: Environment variable EPS is not set
ru_ru: Переменная окружения EPS не установлена

source: Format string is too long: %zu
ru_ru: Слишком длинная форматная строка: %zu

source: Input element is too long
ru_ru: Элемент ввода имеет слишком большую длину

source: Input error from %s file
ru_ru: Ошибка ввода из файла %s

source: Input error while seeking EOLN
ru_ru: Ошибка ввода при поиске символа окончания строки в файле

source: Input error: %s
ru_ru: Ошибка ввода: %s

source: Invalid arguments
ru_ru: Недопустимый аргумент

source: Invalid buf_size %zu
ru_ru: Недопустимое значение параметра buf_size %zu

source: Invalid control character %d
ru_ru: Недопустимый управляющий символ с кодом %d

source: Invalid control character with code %d
ru_ru: Недопустимый управляющий символ с кодом %d

source: Invalid number of arguments: %d instead of %d
ru_ru: Недопустимое число аргументов: %d вместо %d

source: Invalid result %d in description %d
ru_ru: Неверный код результата %d в дескрипторе теста %d

source: Invalid score %d in description %d
ru_ru: Неверный балл %d в дескрипторе теста %d

source: Invalid time %d in description %d
ru_ru: Неверное значение %d в дескрипторе теста %d

source: Letter case mismatch
ru_ru: Несовпадение регистра букв

source: Line %zu differs: output: >%s< correct: >%s<
ru_ru: Различие в строке %zu: вывод: >%s< эталон: >%s<

source: No final \n in the output file
ru_ru: В выходном файле отсутствует заключительный \n

source: Out of heap memory: calloc(%zu,%zu) failed
ru_ru: Закончилась динамическая память при вызове calloc(%zu,%zu)

source: Out of heap memory: malloc(%zu) failed
ru_ru: Закончилась динамическая память при вызове malloc(%zu)

source: Out of heap memory: realloc(...,%zu) failed
ru_ru: Закончилась динамическая память при вызове realloc(...,%zu)

source: Out of heap memory: strdup(`%s') failed
ru_ru: Закончилась динамическая память при вызове strdup(`%s')

source: Test count (%d) is invalid
ru_ru: Недопустимое общее количество тестов (%d)

source: Test info is requested, but no code compiled in
ru_ru: Запрошена информация о тесте, но данный режим не поддерживается

source: Test info parsing failed: %s
ru_ru: Ошибка разбора файла информации о тесте: %s

source: Too few numbers in the output
ru_ru: В выводе слишком мало чисел

source: Too many numbers in the output
ru_ru: В выводе слишком много чисел

source: Unexpected EOF
ru_ru: Неожиданный конец файла

source: Unexpected EOF while reading '%s'
ru_ru: Неожиданный конец файла при чтении '%s'

source: Unexpected EOF while seeking EOLN
ru_ru: Неожиданный конец файла при поиске символа конца строки в файле

source: User answer is neither `yes' nor `no' (case insensitive)
ru_ru: Вывод на проверку не является ни строкой 'yes', ни строкой 'no' (без учета регистра букв)

source: Wrong answer: output: %s, correct: %s
ru_ru: Неправильный ответ: вывод: %s, эталон: %s

source: \0 byte in file
ru_ru: В файле обнаружен байт со значением 0

source: alloca(%zu) failed
ru_ru: Вызов alloca(%zu) завершился с ошибкой

source: correct
ru_ru: эталон

source: correct: not a number
ru_ru: эталон: нарушен формат записи чисел

source: fscanf returned 0!!!
ru_ru: Вызов fscanf вернул 0!!!

source: output
ru_ru: вывод

source: output: not a number
ru_ru: вывод: нарушен формат записи чисел

source: test correct output
ru_ru: эталонный вывод

source: test input data
ru_ru: входные данные

source: user program output
ru_ru: вывод программы
